RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_gamma_reg.h
/**
  ******************************************************************************
  * @file    dsp2_gamma_reg.h
  * @version V1.0
  * @date    2021-02-05
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __DSP2_GAMMA_REG_H__
#define __DSP2_GAMMA_REG_H__

#include "bl808.h"

/* 0x700 : GAMMA_CRUVE_1 */
#define DSP2_GAMMA_GAMMA_CRUVE_1_OFFSET (0x700)
#define DSP2_GAMMA_C0_PRE               DSP2_GAMMA_C0_PRE
#define DSP2_GAMMA_C0_PRE_POS           (0U)
#define DSP2_GAMMA_C0_PRE_LEN           (8U)
#define DSP2_GAMMA_C0_PRE_MSK           (((1U << DSP2_GAMMA_C0_PRE_LEN) - 1) << DSP2_GAMMA_C0_PRE_POS)
#define DSP2_GAMMA_C0_PRE_UMSK          (~(((1U << DSP2_GAMMA_C0_PRE_LEN) - 1) << DSP2_GAMMA_C0_PRE_POS))
#define DSP2_GAMMA_C1_PRE               DSP2_GAMMA_C1_PRE
#define DSP2_GAMMA_C1_PRE_POS           (8U)
#define DSP2_GAMMA_C1_PRE_LEN           (8U)
#define DSP2_GAMMA_C1_PRE_MSK           (((1U << DSP2_GAMMA_C1_PRE_LEN) - 1) << DSP2_GAMMA_C1_PRE_POS)
#define DSP2_GAMMA_C1_PRE_UMSK          (~(((1U << DSP2_GAMMA_C1_PRE_LEN) - 1) << DSP2_GAMMA_C1_PRE_POS))
#define DSP2_GAMMA_C2_PRE               DSP2_GAMMA_C2_PRE
#define DSP2_GAMMA_C2_PRE_POS           (16U)
#define DSP2_GAMMA_C2_PRE_LEN           (8U)
#define DSP2_GAMMA_C2_PRE_MSK           (((1U << DSP2_GAMMA_C2_PRE_LEN) - 1) << DSP2_GAMMA_C2_PRE_POS)
#define DSP2_GAMMA_C2_PRE_UMSK          (~(((1U << DSP2_GAMMA_C2_PRE_LEN) - 1) << DSP2_GAMMA_C2_PRE_POS))
#define DSP2_GAMMA_C3_PRE               DSP2_GAMMA_C3_PRE
#define DSP2_GAMMA_C3_PRE_POS           (24U)
#define DSP2_GAMMA_C3_PRE_LEN           (8U)
#define DSP2_GAMMA_C3_PRE_MSK           (((1U << DSP2_GAMMA_C3_PRE_LEN) - 1) << DSP2_GAMMA_C3_PRE_POS)
#define DSP2_GAMMA_C3_PRE_UMSK          (~(((1U << DSP2_GAMMA_C3_PRE_LEN) - 1) << DSP2_GAMMA_C3_PRE_POS))

/* 0x704 : GAMMA_CRUVE_2 */
#define DSP2_GAMMA_GAMMA_CRUVE_2_OFFSET (0x704)
#define DSP2_GAMMA_C4_PRE               DSP2_GAMMA_C4_PRE
#define DSP2_GAMMA_C4_PRE_POS           (0U)
#define DSP2_GAMMA_C4_PRE_LEN           (8U)
#define DSP2_GAMMA_C4_PRE_MSK           (((1U << DSP2_GAMMA_C4_PRE_LEN) - 1) << DSP2_GAMMA_C4_PRE_POS)
#define DSP2_GAMMA_C4_PRE_UMSK          (~(((1U << DSP2_GAMMA_C4_PRE_LEN) - 1) << DSP2_GAMMA_C4_PRE_POS))
#define DSP2_GAMMA_C5_PRE               DSP2_GAMMA_C5_PRE
#define DSP2_GAMMA_C5_PRE_POS           (8U)
#define DSP2_GAMMA_C5_PRE_LEN           (8U)
#define DSP2_GAMMA_C5_PRE_MSK           (((1U << DSP2_GAMMA_C5_PRE_LEN) - 1) << DSP2_GAMMA_C5_PRE_POS)
#define DSP2_GAMMA_C5_PRE_UMSK          (~(((1U << DSP2_GAMMA_C5_PRE_LEN) - 1) << DSP2_GAMMA_C5_PRE_POS))
#define DSP2_GAMMA_C6_PRE               DSP2_GAMMA_C6_PRE
#define DSP2_GAMMA_C6_PRE_POS           (16U)
#define DSP2_GAMMA_C6_PRE_LEN           (8U)
#define DSP2_GAMMA_C6_PRE_MSK           (((1U << DSP2_GAMMA_C6_PRE_LEN) - 1) << DSP2_GAMMA_C6_PRE_POS)
#define DSP2_GAMMA_C6_PRE_UMSK          (~(((1U << DSP2_GAMMA_C6_PRE_LEN) - 1) << DSP2_GAMMA_C6_PRE_POS))
#define DSP2_GAMMA_C7_PRE               DSP2_GAMMA_C7_PRE
#define DSP2_GAMMA_C7_PRE_POS           (24U)
#define DSP2_GAMMA_C7_PRE_LEN           (8U)
#define DSP2_GAMMA_C7_PRE_MSK           (((1U << DSP2_GAMMA_C7_PRE_LEN) - 1) << DSP2_GAMMA_C7_PRE_POS)
#define DSP2_GAMMA_C7_PRE_UMSK          (~(((1U << DSP2_GAMMA_C7_PRE_LEN) - 1) << DSP2_GAMMA_C7_PRE_POS))

/* 0x708 : GAMMA_CRUVE_3 */
#define DSP2_GAMMA_GAMMA_CRUVE_3_OFFSET (0x708)
#define DSP2_GAMMA_C8_PRE               DSP2_GAMMA_C8_PRE
#define DSP2_GAMMA_C8_PRE_POS           (0U)
#define DSP2_GAMMA_C8_PRE_LEN           (8U)
#define DSP2_GAMMA_C8_PRE_MSK           (((1U << DSP2_GAMMA_C8_PRE_LEN) - 1) << DSP2_GAMMA_C8_PRE_POS)
#define DSP2_GAMMA_C8_PRE_UMSK          (~(((1U << DSP2_GAMMA_C8_PRE_LEN) - 1) << DSP2_GAMMA_C8_PRE_POS))
#define DSP2_GAMMA_C9_PRE               DSP2_GAMMA_C9_PRE
#define DSP2_GAMMA_C9_PRE_POS           (8U)
#define DSP2_GAMMA_C9_PRE_LEN           (8U)
#define DSP2_GAMMA_C9_PRE_MSK           (((1U << DSP2_GAMMA_C9_PRE_LEN) - 1) << DSP2_GAMMA_C9_PRE_POS)
#define DSP2_GAMMA_C9_PRE_UMSK          (~(((1U << DSP2_GAMMA_C9_PRE_LEN) - 1) << DSP2_GAMMA_C9_PRE_POS))
#define DSP2_GAMMA_C10_PRE              DSP2_GAMMA_C10_PRE
#define DSP2_GAMMA_C10_PRE_POS          (16U)
#define DSP2_GAMMA_C10_PRE_LEN          (8U)
#define DSP2_GAMMA_C10_PRE_MSK          (((1U << DSP2_GAMMA_C10_PRE_LEN) - 1) << DSP2_GAMMA_C10_PRE_POS)
#define DSP2_GAMMA_C10_PRE_UMSK         (~(((1U << DSP2_GAMMA_C10_PRE_LEN) - 1) << DSP2_GAMMA_C10_PRE_POS))
#define DSP2_GAMMA_C11_PRE              DSP2_GAMMA_C11_PRE
#define DSP2_GAMMA_C11_PRE_POS          (24U)
#define DSP2_GAMMA_C11_PRE_LEN          (8U)
#define DSP2_GAMMA_C11_PRE_MSK          (((1U << DSP2_GAMMA_C11_PRE_LEN) - 1) << DSP2_GAMMA_C11_PRE_POS)
#define DSP2_GAMMA_C11_PRE_UMSK         (~(((1U << DSP2_GAMMA_C11_PRE_LEN) - 1) << DSP2_GAMMA_C11_PRE_POS))

/* 0x70C : GAMMA_CRUVE_4 */
#define DSP2_GAMMA_GAMMA_CRUVE_4_OFFSET (0x70C)
#define DSP2_GAMMA_C12_PRE              DSP2_GAMMA_C12_PRE
#define DSP2_GAMMA_C12_PRE_POS          (0U)
#define DSP2_GAMMA_C12_PRE_LEN          (8U)
#define DSP2_GAMMA_C12_PRE_MSK          (((1U << DSP2_GAMMA_C12_PRE_LEN) - 1) << DSP2_GAMMA_C12_PRE_POS)
#define DSP2_GAMMA_C12_PRE_UMSK         (~(((1U << DSP2_GAMMA_C12_PRE_LEN) - 1) << DSP2_GAMMA_C12_PRE_POS))
#define DSP2_GAMMA_C13_PRE              DSP2_GAMMA_C13_PRE
#define DSP2_GAMMA_C13_PRE_POS          (8U)
#define DSP2_GAMMA_C13_PRE_LEN          (8U)
#define DSP2_GAMMA_C13_PRE_MSK          (((1U << DSP2_GAMMA_C13_PRE_LEN) - 1) << DSP2_GAMMA_C13_PRE_POS)
#define DSP2_GAMMA_C13_PRE_UMSK         (~(((1U << DSP2_GAMMA_C13_PRE_LEN) - 1) << DSP2_GAMMA_C13_PRE_POS))
#define DSP2_GAMMA_C14_PRE              DSP2_GAMMA_C14_PRE
#define DSP2_GAMMA_C14_PRE_POS          (16U)
#define DSP2_GAMMA_C14_PRE_LEN          (8U)
#define DSP2_GAMMA_C14_PRE_MSK          (((1U << DSP2_GAMMA_C14_PRE_LEN) - 1) << DSP2_GAMMA_C14_PRE_POS)
#define DSP2_GAMMA_C14_PRE_UMSK         (~(((1U << DSP2_GAMMA_C14_PRE_LEN) - 1) << DSP2_GAMMA_C14_PRE_POS))
#define DSP2_GAMMA_C15_PRE              DSP2_GAMMA_C15_PRE
#define DSP2_GAMMA_C15_PRE_POS          (24U)
#define DSP2_GAMMA_C15_PRE_LEN          (8U)
#define DSP2_GAMMA_C15_PRE_MSK          (((1U << DSP2_GAMMA_C15_PRE_LEN) - 1) << DSP2_GAMMA_C15_PRE_POS)
#define DSP2_GAMMA_C15_PRE_UMSK         (~(((1U << DSP2_GAMMA_C15_PRE_LEN) - 1) << DSP2_GAMMA_C15_PRE_POS))

/* 0x710 : GAMMA_CRUVE_5 */
#define DSP2_GAMMA_GAMMA_CRUVE_5_OFFSET (0x710)
#define DSP2_GAMMA_C16_PRE              DSP2_GAMMA_C16_PRE
#define DSP2_GAMMA_C16_PRE_POS          (0U)
#define DSP2_GAMMA_C16_PRE_LEN          (8U)
#define DSP2_GAMMA_C16_PRE_MSK          (((1U << DSP2_GAMMA_C16_PRE_LEN) - 1) << DSP2_GAMMA_C16_PRE_POS)
#define DSP2_GAMMA_C16_PRE_UMSK         (~(((1U << DSP2_GAMMA_C16_PRE_LEN) - 1) << DSP2_GAMMA_C16_PRE_POS))
#define DSP2_GAMMA_C17_PRE              DSP2_GAMMA_C17_PRE
#define DSP2_GAMMA_C17_PRE_POS          (8U)
#define DSP2_GAMMA_C17_PRE_LEN          (8U)
#define DSP2_GAMMA_C17_PRE_MSK          (((1U << DSP2_GAMMA_C17_PRE_LEN) - 1) << DSP2_GAMMA_C17_PRE_POS)
#define DSP2_GAMMA_C17_PRE_UMSK         (~(((1U << DSP2_GAMMA_C17_PRE_LEN) - 1) << DSP2_GAMMA_C17_PRE_POS))
#define DSP2_GAMMA_C18_PRE              DSP2_GAMMA_C18_PRE
#define DSP2_GAMMA_C18_PRE_POS          (16U)
#define DSP2_GAMMA_C18_PRE_LEN          (8U)
#define DSP2_GAMMA_C18_PRE_MSK          (((1U << DSP2_GAMMA_C18_PRE_LEN) - 1) << DSP2_GAMMA_C18_PRE_POS)
#define DSP2_GAMMA_C18_PRE_UMSK         (~(((1U << DSP2_GAMMA_C18_PRE_LEN) - 1) << DSP2_GAMMA_C18_PRE_POS))
#define DSP2_GAMMA_C19_PRE              DSP2_GAMMA_C19_PRE
#define DSP2_GAMMA_C19_PRE_POS          (24U)
#define DSP2_GAMMA_C19_PRE_LEN          (8U)
#define DSP2_GAMMA_C19_PRE_MSK          (((1U << DSP2_GAMMA_C19_PRE_LEN) - 1) << DSP2_GAMMA_C19_PRE_POS)
#define DSP2_GAMMA_C19_PRE_UMSK         (~(((1U << DSP2_GAMMA_C19_PRE_LEN) - 1) << DSP2_GAMMA_C19_PRE_POS))

/* 0x714 : GAMMA_CRUVE_6 */
#define DSP2_GAMMA_GAMMA_CRUVE_6_OFFSET (0x714)
#define DSP2_GAMMA_C20_PRE              DSP2_GAMMA_C20_PRE
#define DSP2_GAMMA_C20_PRE_POS          (0U)
#define DSP2_GAMMA_C20_PRE_LEN          (8U)
#define DSP2_GAMMA_C20_PRE_MSK          (((1U << DSP2_GAMMA_C20_PRE_LEN) - 1) << DSP2_GAMMA_C20_PRE_POS)
#define DSP2_GAMMA_C20_PRE_UMSK         (~(((1U << DSP2_GAMMA_C20_PRE_LEN) - 1) << DSP2_GAMMA_C20_PRE_POS))
#define DSP2_GAMMA_C21_PRE              DSP2_GAMMA_C21_PRE
#define DSP2_GAMMA_C21_PRE_POS          (8U)
#define DSP2_GAMMA_C21_PRE_LEN          (8U)
#define DSP2_GAMMA_C21_PRE_MSK          (((1U << DSP2_GAMMA_C21_PRE_LEN) - 1) << DSP2_GAMMA_C21_PRE_POS)
#define DSP2_GAMMA_C21_PRE_UMSK         (~(((1U << DSP2_GAMMA_C21_PRE_LEN) - 1) << DSP2_GAMMA_C21_PRE_POS))
#define DSP2_GAMMA_C22_PRE              DSP2_GAMMA_C22_PRE
#define DSP2_GAMMA_C22_PRE_POS          (16U)
#define DSP2_GAMMA_C22_PRE_LEN          (8U)
#define DSP2_GAMMA_C22_PRE_MSK          (((1U << DSP2_GAMMA_C22_PRE_LEN) - 1) << DSP2_GAMMA_C22_PRE_POS)
#define DSP2_GAMMA_C22_PRE_UMSK         (~(((1U << DSP2_GAMMA_C22_PRE_LEN) - 1) << DSP2_GAMMA_C22_PRE_POS))
#define DSP2_GAMMA_C23_PRE              DSP2_GAMMA_C23_PRE
#define DSP2_GAMMA_C23_PRE_POS          (24U)
#define DSP2_GAMMA_C23_PRE_LEN          (8U)
#define DSP2_GAMMA_C23_PRE_MSK          (((1U << DSP2_GAMMA_C23_PRE_LEN) - 1) << DSP2_GAMMA_C23_PRE_POS)
#define DSP2_GAMMA_C23_PRE_UMSK         (~(((1U << DSP2_GAMMA_C23_PRE_LEN) - 1) << DSP2_GAMMA_C23_PRE_POS))

/* 0x718 : GAMMA_CRUVE_7 */
#define DSP2_GAMMA_GAMMA_CRUVE_7_OFFSET (0x718)
#define DSP2_GAMMA_C24_PRE              DSP2_GAMMA_C24_PRE
#define DSP2_GAMMA_C24_PRE_POS          (0U)
#define DSP2_GAMMA_C24_PRE_LEN          (8U)
#define DSP2_GAMMA_C24_PRE_MSK          (((1U << DSP2_GAMMA_C24_PRE_LEN) - 1) << DSP2_GAMMA_C24_PRE_POS)
#define DSP2_GAMMA_C24_PRE_UMSK         (~(((1U << DSP2_GAMMA_C24_PRE_LEN) - 1) << DSP2_GAMMA_C24_PRE_POS))
#define DSP2_GAMMA_C25_PRE              DSP2_GAMMA_C25_PRE
#define DSP2_GAMMA_C25_PRE_POS          (8U)
#define DSP2_GAMMA_C25_PRE_LEN          (8U)
#define DSP2_GAMMA_C25_PRE_MSK          (((1U << DSP2_GAMMA_C25_PRE_LEN) - 1) << DSP2_GAMMA_C25_PRE_POS)
#define DSP2_GAMMA_C25_PRE_UMSK         (~(((1U << DSP2_GAMMA_C25_PRE_LEN) - 1) << DSP2_GAMMA_C25_PRE_POS))
#define DSP2_GAMMA_C26_PRE              DSP2_GAMMA_C26_PRE
#define DSP2_GAMMA_C26_PRE_POS          (16U)
#define DSP2_GAMMA_C26_PRE_LEN          (8U)
#define DSP2_GAMMA_C26_PRE_MSK          (((1U << DSP2_GAMMA_C26_PRE_LEN) - 1) << DSP2_GAMMA_C26_PRE_POS)
#define DSP2_GAMMA_C26_PRE_UMSK         (~(((1U << DSP2_GAMMA_C26_PRE_LEN) - 1) << DSP2_GAMMA_C26_PRE_POS))
#define DSP2_GAMMA_C27_PRE              DSP2_GAMMA_C27_PRE
#define DSP2_GAMMA_C27_PRE_POS          (24U)
#define DSP2_GAMMA_C27_PRE_LEN          (8U)
#define DSP2_GAMMA_C27_PRE_MSK          (((1U << DSP2_GAMMA_C27_PRE_LEN) - 1) << DSP2_GAMMA_C27_PRE_POS)
#define DSP2_GAMMA_C27_PRE_UMSK         (~(((1U << DSP2_GAMMA_C27_PRE_LEN) - 1) << DSP2_GAMMA_C27_PRE_POS))

/* 0x71C : GAMMA_CRUVE_8 */
#define DSP2_GAMMA_GAMMA_CRUVE_8_OFFSET (0x71C)
#define DSP2_GAMMA_C28_PRE              DSP2_GAMMA_C28_PRE
#define DSP2_GAMMA_C28_PRE_POS          (0U)
#define DSP2_GAMMA_C28_PRE_LEN          (8U)
#define DSP2_GAMMA_C28_PRE_MSK          (((1U << DSP2_GAMMA_C28_PRE_LEN) - 1) << DSP2_GAMMA_C28_PRE_POS)
#define DSP2_GAMMA_C28_PRE_UMSK         (~(((1U << DSP2_GAMMA_C28_PRE_LEN) - 1) << DSP2_GAMMA_C28_PRE_POS))
#define DSP2_GAMMA_C29_PRE              DSP2_GAMMA_C29_PRE
#define DSP2_GAMMA_C29_PRE_POS          (8U)
#define DSP2_GAMMA_C29_PRE_LEN          (8U)
#define DSP2_GAMMA_C29_PRE_MSK          (((1U << DSP2_GAMMA_C29_PRE_LEN) - 1) << DSP2_GAMMA_C29_PRE_POS)
#define DSP2_GAMMA_C29_PRE_UMSK         (~(((1U << DSP2_GAMMA_C29_PRE_LEN) - 1) << DSP2_GAMMA_C29_PRE_POS))
#define DSP2_GAMMA_C30_PRE              DSP2_GAMMA_C30_PRE
#define DSP2_GAMMA_C30_PRE_POS          (16U)
#define DSP2_GAMMA_C30_PRE_LEN          (8U)
#define DSP2_GAMMA_C30_PRE_MSK          (((1U << DSP2_GAMMA_C30_PRE_LEN) - 1) << DSP2_GAMMA_C30_PRE_POS)
#define DSP2_GAMMA_C30_PRE_UMSK         (~(((1U << DSP2_GAMMA_C30_PRE_LEN) - 1) << DSP2_GAMMA_C30_PRE_POS))
#define DSP2_GAMMA_C31_PRE              DSP2_GAMMA_C31_PRE
#define DSP2_GAMMA_C31_PRE_POS          (24U)
#define DSP2_GAMMA_C31_PRE_LEN          (8U)
#define DSP2_GAMMA_C31_PRE_MSK          (((1U << DSP2_GAMMA_C31_PRE_LEN) - 1) << DSP2_GAMMA_C31_PRE_POS)
#define DSP2_GAMMA_C31_PRE_UMSK         (~(((1U << DSP2_GAMMA_C31_PRE_LEN) - 1) << DSP2_GAMMA_C31_PRE_POS))

/* 0x720 : GAMMA_CRUVE_9 */
#define DSP2_GAMMA_GAMMA_CRUVE_9_OFFSET (0x720)
#define DSP2_GAMMA_C32_PRE              DSP2_GAMMA_C32_PRE
#define DSP2_GAMMA_C32_PRE_POS          (0U)
#define DSP2_GAMMA_C32_PRE_LEN          (8U)
#define DSP2_GAMMA_C32_PRE_MSK          (((1U << DSP2_GAMMA_C32_PRE_LEN) - 1) << DSP2_GAMMA_C32_PRE_POS)
#define DSP2_GAMMA_C32_PRE_UMSK         (~(((1U << DSP2_GAMMA_C32_PRE_LEN) - 1) << DSP2_GAMMA_C32_PRE_POS))
#define DSP2_GAMMA_C33_PRE              DSP2_GAMMA_C33_PRE
#define DSP2_GAMMA_C33_PRE_POS          (8U)
#define DSP2_GAMMA_C33_PRE_LEN          (8U)
#define DSP2_GAMMA_C33_PRE_MSK          (((1U << DSP2_GAMMA_C33_PRE_LEN) - 1) << DSP2_GAMMA_C33_PRE_POS)
#define DSP2_GAMMA_C33_PRE_UMSK         (~(((1U << DSP2_GAMMA_C33_PRE_LEN) - 1) << DSP2_GAMMA_C33_PRE_POS))
#define DSP2_GAMMA_C34_PRE              DSP2_GAMMA_C34_PRE
#define DSP2_GAMMA_C34_PRE_POS          (16U)
#define DSP2_GAMMA_C34_PRE_LEN          (8U)
#define DSP2_GAMMA_C34_PRE_MSK          (((1U << DSP2_GAMMA_C34_PRE_LEN) - 1) << DSP2_GAMMA_C34_PRE_POS)
#define DSP2_GAMMA_C34_PRE_UMSK         (~(((1U << DSP2_GAMMA_C34_PRE_LEN) - 1) << DSP2_GAMMA_C34_PRE_POS))
#define DSP2_GAMMA_C35_PRE              DSP2_GAMMA_C35_PRE
#define DSP2_GAMMA_C35_PRE_POS          (24U)
#define DSP2_GAMMA_C35_PRE_LEN          (8U)
#define DSP2_GAMMA_C35_PRE_MSK          (((1U << DSP2_GAMMA_C35_PRE_LEN) - 1) << DSP2_GAMMA_C35_PRE_POS)
#define DSP2_GAMMA_C35_PRE_UMSK         (~(((1U << DSP2_GAMMA_C35_PRE_LEN) - 1) << DSP2_GAMMA_C35_PRE_POS))

