RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_gamma_reg.h
/* 0x724 : GAMMA_CRUVE_10 */
#define DSP2_GAMMA_GAMMA_CRUVE_10_OFFSET (0x724)
#define DSP2_GAMMA_C36_PRE               DSP2_GAMMA_C36_PRE
#define DSP2_GAMMA_C36_PRE_POS           (0U)
#define DSP2_GAMMA_C36_PRE_LEN           (8U)
#define DSP2_GAMMA_C36_PRE_MSK           (((1U << DSP2_GAMMA_C36_PRE_LEN) - 1) << DSP2_GAMMA_C36_PRE_POS)
#define DSP2_GAMMA_C36_PRE_UMSK          (~(((1U << DSP2_GAMMA_C36_PRE_LEN) - 1) << DSP2_GAMMA_C36_PRE_POS))
#define DSP2_GAMMA_C37_PRE               DSP2_GAMMA_C37_PRE
#define DSP2_GAMMA_C37_PRE_POS           (8U)
#define DSP2_GAMMA_C37_PRE_LEN           (8U)
#define DSP2_GAMMA_C37_PRE_MSK           (((1U << DSP2_GAMMA_C37_PRE_LEN) - 1) << DSP2_GAMMA_C37_PRE_POS)
#define DSP2_GAMMA_C37_PRE_UMSK          (~(((1U << DSP2_GAMMA_C37_PRE_LEN) - 1) << DSP2_GAMMA_C37_PRE_POS))
#define DSP2_GAMMA_C38_PRE               DSP2_GAMMA_C38_PRE
#define DSP2_GAMMA_C38_PRE_POS           (16U)
#define DSP2_GAMMA_C38_PRE_LEN           (8U)
#define DSP2_GAMMA_C38_PRE_MSK           (((1U << DSP2_GAMMA_C38_PRE_LEN) - 1) << DSP2_GAMMA_C38_PRE_POS)
#define DSP2_GAMMA_C38_PRE_UMSK          (~(((1U << DSP2_GAMMA_C38_PRE_LEN) - 1) << DSP2_GAMMA_C38_PRE_POS))
#define DSP2_GAMMA_C39_PRE               DSP2_GAMMA_C39_PRE
#define DSP2_GAMMA_C39_PRE_POS           (24U)
#define DSP2_GAMMA_C39_PRE_LEN           (8U)
#define DSP2_GAMMA_C39_PRE_MSK           (((1U << DSP2_GAMMA_C39_PRE_LEN) - 1) << DSP2_GAMMA_C39_PRE_POS)
#define DSP2_GAMMA_C39_PRE_UMSK          (~(((1U << DSP2_GAMMA_C39_PRE_LEN) - 1) << DSP2_GAMMA_C39_PRE_POS))

/* 0x728 : GAMMA_CRUVE_11 */
#define DSP2_GAMMA_GAMMA_CRUVE_11_OFFSET (0x728)
#define DSP2_GAMMA_C40_PRE               DSP2_GAMMA_C40_PRE
#define DSP2_GAMMA_C40_PRE_POS           (0U)
#define DSP2_GAMMA_C40_PRE_LEN           (8U)
#define DSP2_GAMMA_C40_PRE_MSK           (((1U << DSP2_GAMMA_C40_PRE_LEN) - 1) << DSP2_GAMMA_C40_PRE_POS)
#define DSP2_GAMMA_C40_PRE_UMSK          (~(((1U << DSP2_GAMMA_C40_PRE_LEN) - 1) << DSP2_GAMMA_C40_PRE_POS))
#define DSP2_GAMMA_C41_PRE               DSP2_GAMMA_C41_PRE
#define DSP2_GAMMA_C41_PRE_POS           (8U)
#define DSP2_GAMMA_C41_PRE_LEN           (8U)
#define DSP2_GAMMA_C41_PRE_MSK           (((1U << DSP2_GAMMA_C41_PRE_LEN) - 1) << DSP2_GAMMA_C41_PRE_POS)
#define DSP2_GAMMA_C41_PRE_UMSK          (~(((1U << DSP2_GAMMA_C41_PRE_LEN) - 1) << DSP2_GAMMA_C41_PRE_POS))
#define DSP2_GAMMA_C42_PRE               DSP2_GAMMA_C42_PRE
#define DSP2_GAMMA_C42_PRE_POS           (16U)
#define DSP2_GAMMA_C42_PRE_LEN           (8U)
#define DSP2_GAMMA_C42_PRE_MSK           (((1U << DSP2_GAMMA_C42_PRE_LEN) - 1) << DSP2_GAMMA_C42_PRE_POS)
#define DSP2_GAMMA_C42_PRE_UMSK          (~(((1U << DSP2_GAMMA_C42_PRE_LEN) - 1) << DSP2_GAMMA_C42_PRE_POS))
#define DSP2_GAMMA_C43_PRE               DSP2_GAMMA_C43_PRE
#define DSP2_GAMMA_C43_PRE_POS           (24U)
#define DSP2_GAMMA_C43_PRE_LEN           (8U)
#define DSP2_GAMMA_C43_PRE_MSK           (((1U << DSP2_GAMMA_C43_PRE_LEN) - 1) << DSP2_GAMMA_C43_PRE_POS)
#define DSP2_GAMMA_C43_PRE_UMSK          (~(((1U << DSP2_GAMMA_C43_PRE_LEN) - 1) << DSP2_GAMMA_C43_PRE_POS))

/* 0x72C : GAMMA_CRUVE_12 */
#define DSP2_GAMMA_GAMMA_CRUVE_12_OFFSET (0x72C)
#define DSP2_GAMMA_C44_PRE               DSP2_GAMMA_C44_PRE
#define DSP2_GAMMA_C44_PRE_POS           (0U)
#define DSP2_GAMMA_C44_PRE_LEN           (8U)
#define DSP2_GAMMA_C44_PRE_MSK           (((1U << DSP2_GAMMA_C44_PRE_LEN) - 1) << DSP2_GAMMA_C44_PRE_POS)
#define DSP2_GAMMA_C44_PRE_UMSK          (~(((1U << DSP2_GAMMA_C44_PRE_LEN) - 1) << DSP2_GAMMA_C44_PRE_POS))
#define DSP2_GAMMA_C45_PRE               DSP2_GAMMA_C45_PRE
#define DSP2_GAMMA_C45_PRE_POS           (8U)
#define DSP2_GAMMA_C45_PRE_LEN           (8U)
#define DSP2_GAMMA_C45_PRE_MSK           (((1U << DSP2_GAMMA_C45_PRE_LEN) - 1) << DSP2_GAMMA_C45_PRE_POS)
#define DSP2_GAMMA_C45_PRE_UMSK          (~(((1U << DSP2_GAMMA_C45_PRE_LEN) - 1) << DSP2_GAMMA_C45_PRE_POS))
#define DSP2_GAMMA_C46_PRE               DSP2_GAMMA_C46_PRE
#define DSP2_GAMMA_C46_PRE_POS           (16U)
#define DSP2_GAMMA_C46_PRE_LEN           (8U)
#define DSP2_GAMMA_C46_PRE_MSK           (((1U << DSP2_GAMMA_C46_PRE_LEN) - 1) << DSP2_GAMMA_C46_PRE_POS)
#define DSP2_GAMMA_C46_PRE_UMSK          (~(((1U << DSP2_GAMMA_C46_PRE_LEN) - 1) << DSP2_GAMMA_C46_PRE_POS))
#define DSP2_GAMMA_C47_PRE               DSP2_GAMMA_C47_PRE
#define DSP2_GAMMA_C47_PRE_POS           (24U)
#define DSP2_GAMMA_C47_PRE_LEN           (8U)
#define DSP2_GAMMA_C47_PRE_MSK           (((1U << DSP2_GAMMA_C47_PRE_LEN) - 1) << DSP2_GAMMA_C47_PRE_POS)
#define DSP2_GAMMA_C47_PRE_UMSK          (~(((1U << DSP2_GAMMA_C47_PRE_LEN) - 1) << DSP2_GAMMA_C47_PRE_POS))

/* 0x730 : GAMMA_CRUVE_13 */
#define DSP2_GAMMA_GAMMA_CRUVE_13_OFFSET (0x730)
#define DSP2_GAMMA_C48_PRE               DSP2_GAMMA_C48_PRE
#define DSP2_GAMMA_C48_PRE_POS           (0U)
#define DSP2_GAMMA_C48_PRE_LEN           (8U)
#define DSP2_GAMMA_C48_PRE_MSK           (((1U << DSP2_GAMMA_C48_PRE_LEN) - 1) << DSP2_GAMMA_C48_PRE_POS)
#define DSP2_GAMMA_C48_PRE_UMSK          (~(((1U << DSP2_GAMMA_C48_PRE_LEN) - 1) << DSP2_GAMMA_C48_PRE_POS))
#define DSP2_GAMMA_C49_PRE               DSP2_GAMMA_C49_PRE
#define DSP2_GAMMA_C49_PRE_POS           (8U)
#define DSP2_GAMMA_C49_PRE_LEN           (8U)
#define DSP2_GAMMA_C49_PRE_MSK           (((1U << DSP2_GAMMA_C49_PRE_LEN) - 1) << DSP2_GAMMA_C49_PRE_POS)
#define DSP2_GAMMA_C49_PRE_UMSK          (~(((1U << DSP2_GAMMA_C49_PRE_LEN) - 1) << DSP2_GAMMA_C49_PRE_POS))
#define DSP2_GAMMA_C50_PRE               DSP2_GAMMA_C50_PRE
#define DSP2_GAMMA_C50_PRE_POS           (16U)
#define DSP2_GAMMA_C50_PRE_LEN           (8U)
#define DSP2_GAMMA_C50_PRE_MSK           (((1U << DSP2_GAMMA_C50_PRE_LEN) - 1) << DSP2_GAMMA_C50_PRE_POS)
#define DSP2_GAMMA_C50_PRE_UMSK          (~(((1U << DSP2_GAMMA_C50_PRE_LEN) - 1) << DSP2_GAMMA_C50_PRE_POS))
#define DSP2_GAMMA_C51_PRE               DSP2_GAMMA_C51_PRE
#define DSP2_GAMMA_C51_PRE_POS           (24U)
#define DSP2_GAMMA_C51_PRE_LEN           (8U)
#define DSP2_GAMMA_C51_PRE_MSK           (((1U << DSP2_GAMMA_C51_PRE_LEN) - 1) << DSP2_GAMMA_C51_PRE_POS)
#define DSP2_GAMMA_C51_PRE_UMSK          (~(((1U << DSP2_GAMMA_C51_PRE_LEN) - 1) << DSP2_GAMMA_C51_PRE_POS))

/* 0x734 : GAMMA_CRUVE_14 */
#define DSP2_GAMMA_GAMMA_CRUVE_14_OFFSET (0x734)
#define DSP2_GAMMA_C52_PRE               DSP2_GAMMA_C52_PRE
#define DSP2_GAMMA_C52_PRE_POS           (0U)
#define DSP2_GAMMA_C52_PRE_LEN           (8U)
#define DSP2_GAMMA_C52_PRE_MSK           (((1U << DSP2_GAMMA_C52_PRE_LEN) - 1) << DSP2_GAMMA_C52_PRE_POS)
#define DSP2_GAMMA_C52_PRE_UMSK          (~(((1U << DSP2_GAMMA_C52_PRE_LEN) - 1) << DSP2_GAMMA_C52_PRE_POS))
#define DSP2_GAMMA_C53_PRE               DSP2_GAMMA_C53_PRE
#define DSP2_GAMMA_C53_PRE_POS           (8U)
#define DSP2_GAMMA_C53_PRE_LEN           (8U)
#define DSP2_GAMMA_C53_PRE_MSK           (((1U << DSP2_GAMMA_C53_PRE_LEN) - 1) << DSP2_GAMMA_C53_PRE_POS)
#define DSP2_GAMMA_C53_PRE_UMSK          (~(((1U << DSP2_GAMMA_C53_PRE_LEN) - 1) << DSP2_GAMMA_C53_PRE_POS))
#define DSP2_GAMMA_C54_PRE               DSP2_GAMMA_C54_PRE
#define DSP2_GAMMA_C54_PRE_POS           (16U)
#define DSP2_GAMMA_C54_PRE_LEN           (8U)
#define DSP2_GAMMA_C54_PRE_MSK           (((1U << DSP2_GAMMA_C54_PRE_LEN) - 1) << DSP2_GAMMA_C54_PRE_POS)
#define DSP2_GAMMA_C54_PRE_UMSK          (~(((1U << DSP2_GAMMA_C54_PRE_LEN) - 1) << DSP2_GAMMA_C54_PRE_POS))
#define DSP2_GAMMA_C55_PRE               DSP2_GAMMA_C55_PRE
#define DSP2_GAMMA_C55_PRE_POS           (24U)
#define DSP2_GAMMA_C55_PRE_LEN           (8U)
#define DSP2_GAMMA_C55_PRE_MSK           (((1U << DSP2_GAMMA_C55_PRE_LEN) - 1) << DSP2_GAMMA_C55_PRE_POS)
#define DSP2_GAMMA_C55_PRE_UMSK          (~(((1U << DSP2_GAMMA_C55_PRE_LEN) - 1) << DSP2_GAMMA_C55_PRE_POS))

/* 0x738 : GAMMA_CRUVE_15 */
#define DSP2_GAMMA_GAMMA_CRUVE_15_OFFSET (0x738)
#define DSP2_GAMMA_C56_PRE               DSP2_GAMMA_C56_PRE
#define DSP2_GAMMA_C56_PRE_POS           (0U)
#define DSP2_GAMMA_C56_PRE_LEN           (8U)
#define DSP2_GAMMA_C56_PRE_MSK           (((1U << DSP2_GAMMA_C56_PRE_LEN) - 1) << DSP2_GAMMA_C56_PRE_POS)
#define DSP2_GAMMA_C56_PRE_UMSK          (~(((1U << DSP2_GAMMA_C56_PRE_LEN) - 1) << DSP2_GAMMA_C56_PRE_POS))
#define DSP2_GAMMA_C57_PRE               DSP2_GAMMA_C57_PRE
#define DSP2_GAMMA_C57_PRE_POS           (8U)
#define DSP2_GAMMA_C57_PRE_LEN           (8U)
#define DSP2_GAMMA_C57_PRE_MSK           (((1U << DSP2_GAMMA_C57_PRE_LEN) - 1) << DSP2_GAMMA_C57_PRE_POS)
#define DSP2_GAMMA_C57_PRE_UMSK          (~(((1U << DSP2_GAMMA_C57_PRE_LEN) - 1) << DSP2_GAMMA_C57_PRE_POS))
#define DSP2_GAMMA_C58_PRE               DSP2_GAMMA_C58_PRE
#define DSP2_GAMMA_C58_PRE_POS           (16U)
#define DSP2_GAMMA_C58_PRE_LEN           (8U)
#define DSP2_GAMMA_C58_PRE_MSK           (((1U << DSP2_GAMMA_C58_PRE_LEN) - 1) << DSP2_GAMMA_C58_PRE_POS)
#define DSP2_GAMMA_C58_PRE_UMSK          (~(((1U << DSP2_GAMMA_C58_PRE_LEN) - 1) << DSP2_GAMMA_C58_PRE_POS))
#define DSP2_GAMMA_C59_PRE               DSP2_GAMMA_C59_PRE
#define DSP2_GAMMA_C59_PRE_POS           (24U)
#define DSP2_GAMMA_C59_PRE_LEN           (8U)
#define DSP2_GAMMA_C59_PRE_MSK           (((1U << DSP2_GAMMA_C59_PRE_LEN) - 1) << DSP2_GAMMA_C59_PRE_POS)
#define DSP2_GAMMA_C59_PRE_UMSK          (~(((1U << DSP2_GAMMA_C59_PRE_LEN) - 1) << DSP2_GAMMA_C59_PRE_POS))

/* 0x73C : GAMMA_CRUVE_16 */
#define DSP2_GAMMA_GAMMA_CRUVE_16_OFFSET (0x73C)
#define DSP2_GAMMA_C60_PRE               DSP2_GAMMA_C60_PRE
#define DSP2_GAMMA_C60_PRE_POS           (0U)
#define DSP2_GAMMA_C60_PRE_LEN           (8U)
#define DSP2_GAMMA_C60_PRE_MSK           (((1U << DSP2_GAMMA_C60_PRE_LEN) - 1) << DSP2_GAMMA_C60_PRE_POS)
#define DSP2_GAMMA_C60_PRE_UMSK          (~(((1U << DSP2_GAMMA_C60_PRE_LEN) - 1) << DSP2_GAMMA_C60_PRE_POS))
#define DSP2_GAMMA_C61_PRE               DSP2_GAMMA_C61_PRE
#define DSP2_GAMMA_C61_PRE_POS           (8U)
#define DSP2_GAMMA_C61_PRE_LEN           (8U)
#define DSP2_GAMMA_C61_PRE_MSK           (((1U << DSP2_GAMMA_C61_PRE_LEN) - 1) << DSP2_GAMMA_C61_PRE_POS)
#define DSP2_GAMMA_C61_PRE_UMSK          (~(((1U << DSP2_GAMMA_C61_PRE_LEN) - 1) << DSP2_GAMMA_C61_PRE_POS))
#define DSP2_GAMMA_C62_PRE               DSP2_GAMMA_C62_PRE
#define DSP2_GAMMA_C62_PRE_POS           (16U)
#define DSP2_GAMMA_C62_PRE_LEN           (8U)
#define DSP2_GAMMA_C62_PRE_MSK           (((1U << DSP2_GAMMA_C62_PRE_LEN) - 1) << DSP2_GAMMA_C62_PRE_POS)
#define DSP2_GAMMA_C62_PRE_UMSK          (~(((1U << DSP2_GAMMA_C62_PRE_LEN) - 1) << DSP2_GAMMA_C62_PRE_POS))
#define DSP2_GAMMA_C63_PRE               DSP2_GAMMA_C63_PRE
#define DSP2_GAMMA_C63_PRE_POS           (24U)
#define DSP2_GAMMA_C63_PRE_LEN           (8U)
#define DSP2_GAMMA_C63_PRE_MSK           (((1U << DSP2_GAMMA_C63_PRE_LEN) - 1) << DSP2_GAMMA_C63_PRE_POS)
#define DSP2_GAMMA_C63_PRE_UMSK          (~(((1U << DSP2_GAMMA_C63_PRE_LEN) - 1) << DSP2_GAMMA_C63_PRE_POS))

/* 0x740 : GAMMA_CRUVE_17 */
#define DSP2_GAMMA_GAMMA_CRUVE_17_OFFSET (0x740)
#define DSP2_GAMMA_C64_PRE               DSP2_GAMMA_C64_PRE
#define DSP2_GAMMA_C64_PRE_POS           (0U)
#define DSP2_GAMMA_C64_PRE_LEN           (8U)
#define DSP2_GAMMA_C64_PRE_MSK           (((1U << DSP2_GAMMA_C64_PRE_LEN) - 1) << DSP2_GAMMA_C64_PRE_POS)
#define DSP2_GAMMA_C64_PRE_UMSK          (~(((1U << DSP2_GAMMA_C64_PRE_LEN) - 1) << DSP2_GAMMA_C64_PRE_POS))
#define DSP2_GAMMA_C65_PRE               DSP2_GAMMA_C65_PRE
#define DSP2_GAMMA_C65_PRE_POS           (8U)
#define DSP2_GAMMA_C65_PRE_LEN           (8U)
#define DSP2_GAMMA_C65_PRE_MSK           (((1U << DSP2_GAMMA_C65_PRE_LEN) - 1) << DSP2_GAMMA_C65_PRE_POS)
#define DSP2_GAMMA_C65_PRE_UMSK          (~(((1U << DSP2_GAMMA_C65_PRE_LEN) - 1) << DSP2_GAMMA_C65_PRE_POS))
#define DSP2_GAMMA_C66_PRE               DSP2_GAMMA_C66_PRE
#define DSP2_GAMMA_C66_PRE_POS           (16U)
#define DSP2_GAMMA_C66_PRE_LEN           (8U)
#define DSP2_GAMMA_C66_PRE_MSK           (((1U << DSP2_GAMMA_C66_PRE_LEN) - 1) << DSP2_GAMMA_C66_PRE_POS)
#define DSP2_GAMMA_C66_PRE_UMSK          (~(((1U << DSP2_GAMMA_C66_PRE_LEN) - 1) << DSP2_GAMMA_C66_PRE_POS))
#define DSP2_GAMMA_C67_PRE               DSP2_GAMMA_C67_PRE
#define DSP2_GAMMA_C67_PRE_POS           (24U)
#define DSP2_GAMMA_C67_PRE_LEN           (8U)
#define DSP2_GAMMA_C67_PRE_MSK           (((1U << DSP2_GAMMA_C67_PRE_LEN) - 1) << DSP2_GAMMA_C67_PRE_POS)
#define DSP2_GAMMA_C67_PRE_UMSK          (~(((1U << DSP2_GAMMA_C67_PRE_LEN) - 1) << DSP2_GAMMA_C67_PRE_POS))

/* 0x744 : GAMMA_CRUVE_18 */
#define DSP2_GAMMA_GAMMA_CRUVE_18_OFFSET (0x744)
#define DSP2_GAMMA_C68_PRE               DSP2_GAMMA_C68_PRE
#define DSP2_GAMMA_C68_PRE_POS           (0U)
#define DSP2_GAMMA_C68_PRE_LEN           (8U)
#define DSP2_GAMMA_C68_PRE_MSK           (((1U << DSP2_GAMMA_C68_PRE_LEN) - 1) << DSP2_GAMMA_C68_PRE_POS)
#define DSP2_GAMMA_C68_PRE_UMSK          (~(((1U << DSP2_GAMMA_C68_PRE_LEN) - 1) << DSP2_GAMMA_C68_PRE_POS))
#define DSP2_GAMMA_C69_PRE               DSP2_GAMMA_C69_PRE
#define DSP2_GAMMA_C69_PRE_POS           (8U)
#define DSP2_GAMMA_C69_PRE_LEN           (8U)
#define DSP2_GAMMA_C69_PRE_MSK           (((1U << DSP2_GAMMA_C69_PRE_LEN) - 1) << DSP2_GAMMA_C69_PRE_POS)
#define DSP2_GAMMA_C69_PRE_UMSK          (~(((1U << DSP2_GAMMA_C69_PRE_LEN) - 1) << DSP2_GAMMA_C69_PRE_POS))
#define DSP2_GAMMA_C70_PRE               DSP2_GAMMA_C70_PRE
#define DSP2_GAMMA_C70_PRE_POS           (16U)
#define DSP2_GAMMA_C70_PRE_LEN           (8U)
#define DSP2_GAMMA_C70_PRE_MSK           (((1U << DSP2_GAMMA_C70_PRE_LEN) - 1) << DSP2_GAMMA_C70_PRE_POS)
#define DSP2_GAMMA_C70_PRE_UMSK          (~(((1U << DSP2_GAMMA_C70_PRE_LEN) - 1) << DSP2_GAMMA_C70_PRE_POS))
#define DSP2_GAMMA_C71_PRE               DSP2_GAMMA_C71_PRE
#define DSP2_GAMMA_C71_PRE_POS           (24U)
#define DSP2_GAMMA_C71_PRE_LEN           (8U)
#define DSP2_GAMMA_C71_PRE_MSK           (((1U << DSP2_GAMMA_C71_PRE_LEN) - 1) << DSP2_GAMMA_C71_PRE_POS)
#define DSP2_GAMMA_C71_PRE_UMSK          (~(((1U << DSP2_GAMMA_C71_PRE_LEN) - 1) << DSP2_GAMMA_C71_PRE_POS))

/* 0x748 : GAMMA_CRUVE_19 */
#define DSP2_GAMMA_GAMMA_CRUVE_19_OFFSET (0x748)
#define DSP2_GAMMA_C72_PRE               DSP2_GAMMA_C72_PRE
#define DSP2_GAMMA_C72_PRE_POS           (0U)
#define DSP2_GAMMA_C72_PRE_LEN           (8U)
#define DSP2_GAMMA_C72_PRE_MSK           (((1U << DSP2_GAMMA_C72_PRE_LEN) - 1) << DSP2_GAMMA_C72_PRE_POS)
#define DSP2_GAMMA_C72_PRE_UMSK          (~(((1U << DSP2_GAMMA_C72_PRE_LEN) - 1) << DSP2_GAMMA_C72_PRE_POS))
#define DSP2_GAMMA_C73_PRE               DSP2_GAMMA_C73_PRE
#define DSP2_GAMMA_C73_PRE_POS           (8U)
#define DSP2_GAMMA_C73_PRE_LEN           (8U)
#define DSP2_GAMMA_C73_PRE_MSK           (((1U << DSP2_GAMMA_C73_PRE_LEN) - 1) << DSP2_GAMMA_C73_PRE_POS)
#define DSP2_GAMMA_C73_PRE_UMSK          (~(((1U << DSP2_GAMMA_C73_PRE_LEN) - 1) << DSP2_GAMMA_C73_PRE_POS))
#define DSP2_GAMMA_C74_PRE               DSP2_GAMMA_C74_PRE
#define DSP2_GAMMA_C74_PRE_POS           (16U)
#define DSP2_GAMMA_C74_PRE_LEN           (8U)
#define DSP2_GAMMA_C74_PRE_MSK           (((1U << DSP2_GAMMA_C74_PRE_LEN) - 1) << DSP2_GAMMA_C74_PRE_POS)
#define DSP2_GAMMA_C74_PRE_UMSK          (~(((1U << DSP2_GAMMA_C74_PRE_LEN) - 1) << DSP2_GAMMA_C74_PRE_POS))
#define DSP2_GAMMA_C75_PRE               DSP2_GAMMA_C75_PRE
#define DSP2_GAMMA_C75_PRE_POS           (24U)
#define DSP2_GAMMA_C75_PRE_LEN           (8U)
#define DSP2_GAMMA_C75_PRE_MSK           (((1U << DSP2_GAMMA_C75_PRE_LEN) - 1) << DSP2_GAMMA_C75_PRE_POS)
#define DSP2_GAMMA_C75_PRE_UMSK          (~(((1U << DSP2_GAMMA_C75_PRE_LEN) - 1) << DSP2_GAMMA_C75_PRE_POS))

/* 0x74C : GAMMA_CRUVE_20 */
#define DSP2_GAMMA_GAMMA_CRUVE_20_OFFSET (0x74C)
#define DSP2_GAMMA_C76_PRE               DSP2_GAMMA_C76_PRE
#define DSP2_GAMMA_C76_PRE_POS           (0U)
#define DSP2_GAMMA_C76_PRE_LEN           (8U)
#define DSP2_GAMMA_C76_PRE_MSK           (((1U << DSP2_GAMMA_C76_PRE_LEN) - 1) << DSP2_GAMMA_C76_PRE_POS)
#define DSP2_GAMMA_C76_PRE_UMSK          (~(((1U << DSP2_GAMMA_C76_PRE_LEN) - 1) << DSP2_GAMMA_C76_PRE_POS))
#define DSP2_GAMMA_C77_PRE               DSP2_GAMMA_C77_PRE
#define DSP2_GAMMA_C77_PRE_POS           (8U)
#define DSP2_GAMMA_C77_PRE_LEN           (8U)
#define DSP2_GAMMA_C77_PRE_MSK           (((1U << DSP2_GAMMA_C77_PRE_LEN) - 1) << DSP2_GAMMA_C77_PRE_POS)
#define DSP2_GAMMA_C77_PRE_UMSK          (~(((1U << DSP2_GAMMA_C77_PRE_LEN) - 1) << DSP2_GAMMA_C77_PRE_POS))
#define DSP2_GAMMA_C78_PRE               DSP2_GAMMA_C78_PRE
#define DSP2_GAMMA_C78_PRE_POS           (16U)
#define DSP2_GAMMA_C78_PRE_LEN           (8U)
#define DSP2_GAMMA_C78_PRE_MSK           (((1U << DSP2_GAMMA_C78_PRE_LEN) - 1) << DSP2_GAMMA_C78_PRE_POS)
#define DSP2_GAMMA_C78_PRE_UMSK          (~(((1U << DSP2_GAMMA_C78_PRE_LEN) - 1) << DSP2_GAMMA_C78_PRE_POS))
#define DSP2_GAMMA_C79_PRE               DSP2_GAMMA_C79_PRE
#define DSP2_GAMMA_C79_PRE_POS           (24U)
#define DSP2_GAMMA_C79_PRE_LEN           (8U)
#define DSP2_GAMMA_C79_PRE_MSK           (((1U << DSP2_GAMMA_C79_PRE_LEN) - 1) << DSP2_GAMMA_C79_PRE_POS)
#define DSP2_GAMMA_C79_PRE_UMSK          (~(((1U << DSP2_GAMMA_C79_PRE_LEN) - 1) << DSP2_GAMMA_C79_PRE_POS))

/* 0x750 : GAMMA_CRUVE_21 */
#define DSP2_GAMMA_GAMMA_CRUVE_21_OFFSET (0x750)
#define DSP2_GAMMA_C80_PRE               DSP2_GAMMA_C80_PRE
#define DSP2_GAMMA_C80_PRE_POS           (0U)
#define DSP2_GAMMA_C80_PRE_LEN           (8U)
#define DSP2_GAMMA_C80_PRE_MSK           (((1U << DSP2_GAMMA_C80_PRE_LEN) - 1) << DSP2_GAMMA_C80_PRE_POS)
#define DSP2_GAMMA_C80_PRE_UMSK          (~(((1U << DSP2_GAMMA_C80_PRE_LEN) - 1) << DSP2_GAMMA_C80_PRE_POS))
#define DSP2_GAMMA_C81_PRE               DSP2_GAMMA_C81_PRE
#define DSP2_GAMMA_C81_PRE_POS           (8U)
#define DSP2_GAMMA_C81_PRE_LEN           (8U)
#define DSP2_GAMMA_C81_PRE_MSK           (((1U << DSP2_GAMMA_C81_PRE_LEN) - 1) << DSP2_GAMMA_C81_PRE_POS)
#define DSP2_GAMMA_C81_PRE_UMSK          (~(((1U << DSP2_GAMMA_C81_PRE_LEN) - 1) << DSP2_GAMMA_C81_PRE_POS))
#define DSP2_GAMMA_C82_PRE               DSP2_GAMMA_C82_PRE
#define DSP2_GAMMA_C82_PRE_POS           (16U)
#define DSP2_GAMMA_C82_PRE_LEN           (8U)
#define DSP2_GAMMA_C82_PRE_MSK           (((1U << DSP2_GAMMA_C82_PRE_LEN) - 1) << DSP2_GAMMA_C82_PRE_POS)
#define DSP2_GAMMA_C82_PRE_UMSK          (~(((1U << DSP2_GAMMA_C82_PRE_LEN) - 1) << DSP2_GAMMA_C82_PRE_POS))
#define DSP2_GAMMA_C83_PRE               DSP2_GAMMA_C83_PRE
#define DSP2_GAMMA_C83_PRE_POS           (24U)
#define DSP2_GAMMA_C83_PRE_LEN           (8U)
#define DSP2_GAMMA_C83_PRE_MSK           (((1U << DSP2_GAMMA_C83_PRE_LEN) - 1) << DSP2_GAMMA_C83_PRE_POS)
#define DSP2_GAMMA_C83_PRE_UMSK          (~(((1U << DSP2_GAMMA_C83_PRE_LEN) - 1) << DSP2_GAMMA_C83_PRE_POS))

/* 0x754 : GAMMA_CRUVE_22 */
#define DSP2_GAMMA_GAMMA_CRUVE_22_OFFSET (0x754)
#define DSP2_GAMMA_C84_PRE               DSP2_GAMMA_C84_PRE
#define DSP2_GAMMA_C84_PRE_POS           (0U)
#define DSP2_GAMMA_C84_PRE_LEN           (8U)
#define DSP2_GAMMA_C84_PRE_MSK           (((1U << DSP2_GAMMA_C84_PRE_LEN) - 1) << DSP2_GAMMA_C84_PRE_POS)
#define DSP2_GAMMA_C84_PRE_UMSK          (~(((1U << DSP2_GAMMA_C84_PRE_LEN) - 1) << DSP2_GAMMA_C84_PRE_POS))
#define DSP2_GAMMA_C85_PRE               DSP2_GAMMA_C85_PRE
#define DSP2_GAMMA_C85_PRE_POS           (8U)
#define DSP2_GAMMA_C85_PRE_LEN           (8U)
#define DSP2_GAMMA_C85_PRE_MSK           (((1U << DSP2_GAMMA_C85_PRE_LEN) - 1) << DSP2_GAMMA_C85_PRE_POS)
#define DSP2_GAMMA_C85_PRE_UMSK          (~(((1U << DSP2_GAMMA_C85_PRE_LEN) - 1) << DSP2_GAMMA_C85_PRE_POS))
#define DSP2_GAMMA_C86_PRE               DSP2_GAMMA_C86_PRE
#define DSP2_GAMMA_C86_PRE_POS           (16U)
#define DSP2_GAMMA_C86_PRE_LEN           (8U)
#define DSP2_GAMMA_C86_PRE_MSK           (((1U << DSP2_GAMMA_C86_PRE_LEN) - 1) << DSP2_GAMMA_C86_PRE_POS)
#define DSP2_GAMMA_C86_PRE_UMSK          (~(((1U << DSP2_GAMMA_C86_PRE_LEN) - 1) << DSP2_GAMMA_C86_PRE_POS))
#define DSP2_GAMMA_C87_PRE               DSP2_GAMMA_C87_PRE
#define DSP2_GAMMA_C87_PRE_POS           (24U)
#define DSP2_GAMMA_C87_PRE_LEN           (8U)
#define DSP2_GAMMA_C87_PRE_MSK           (((1U << DSP2_GAMMA_C87_PRE_LEN) - 1) << DSP2_GAMMA_C87_PRE_POS)
#define DSP2_GAMMA_C87_PRE_UMSK          (~(((1U << DSP2_GAMMA_C87_PRE_LEN) - 1) << DSP2_GAMMA_C87_PRE_POS))

/* 0x758 : GAMMA_CRUVE_23 */
#define DSP2_GAMMA_GAMMA_CRUVE_23_OFFSET (0x758)
#define DSP2_GAMMA_C88_PRE               DSP2_GAMMA_C88_PRE
#define DSP2_GAMMA_C88_PRE_POS           (0U)
#define DSP2_GAMMA_C88_PRE_LEN           (8U)
#define DSP2_GAMMA_C88_PRE_MSK           (((1U << DSP2_GAMMA_C88_PRE_LEN) - 1) << DSP2_GAMMA_C88_PRE_POS)
#define DSP2_GAMMA_C88_PRE_UMSK          (~(((1U << DSP2_GAMMA_C88_PRE_LEN) - 1) << DSP2_GAMMA_C88_PRE_POS))
#define DSP2_GAMMA_C89_PRE               DSP2_GAMMA_C89_PRE
#define DSP2_GAMMA_C89_PRE_POS           (8U)
#define DSP2_GAMMA_C89_PRE_LEN           (8U)
#define DSP2_GAMMA_C89_PRE_MSK           (((1U << DSP2_GAMMA_C89_PRE_LEN) - 1) << DSP2_GAMMA_C89_PRE_POS)
#define DSP2_GAMMA_C89_PRE_UMSK          (~(((1U << DSP2_GAMMA_C89_PRE_LEN) - 1) << DSP2_GAMMA_C89_PRE_POS))
#define DSP2_GAMMA_C90_PRE               DSP2_GAMMA_C90_PRE
#define DSP2_GAMMA_C90_PRE_POS           (16U)
#define DSP2_GAMMA_C90_PRE_LEN           (8U)
#define DSP2_GAMMA_C90_PRE_MSK           (((1U << DSP2_GAMMA_C90_PRE_LEN) - 1) << DSP2_GAMMA_C90_PRE_POS)
#define DSP2_GAMMA_C90_PRE_UMSK          (~(((1U << DSP2_GAMMA_C90_PRE_LEN) - 1) << DSP2_GAMMA_C90_PRE_POS))
#define DSP2_GAMMA_C91_PRE               DSP2_GAMMA_C91_PRE
#define DSP2_GAMMA_C91_PRE_POS           (24U)
#define DSP2_GAMMA_C91_PRE_LEN           (8U)
#define DSP2_GAMMA_C91_PRE_MSK           (((1U << DSP2_GAMMA_C91_PRE_LEN) - 1) << DSP2_GAMMA_C91_PRE_POS)
#define DSP2_GAMMA_C91_PRE_UMSK          (~(((1U << DSP2_GAMMA_C91_PRE_LEN) - 1) << DSP2_GAMMA_C91_PRE_POS))

/* 0x75C : GAMMA_CRUVE_24 */
#define DSP2_GAMMA_GAMMA_CRUVE_24_OFFSET (0x75C)
#define DSP2_GAMMA_C92_PRE               DSP2_GAMMA_C92_PRE
#define DSP2_GAMMA_C92_PRE_POS           (0U)
#define DSP2_GAMMA_C92_PRE_LEN           (8U)
#define DSP2_GAMMA_C92_PRE_MSK           (((1U << DSP2_GAMMA_C92_PRE_LEN) - 1) << DSP2_GAMMA_C92_PRE_POS)
#define DSP2_GAMMA_C92_PRE_UMSK          (~(((1U << DSP2_GAMMA_C92_PRE_LEN) - 1) << DSP2_GAMMA_C92_PRE_POS))
#define DSP2_GAMMA_C93_PRE               DSP2_GAMMA_C93_PRE
#define DSP2_GAMMA_C93_PRE_POS           (8U)
#define DSP2_GAMMA_C93_PRE_LEN           (8U)
#define DSP2_GAMMA_C93_PRE_MSK           (((1U << DSP2_GAMMA_C93_PRE_LEN) - 1) << DSP2_GAMMA_C93_PRE_POS)
#define DSP2_GAMMA_C93_PRE_UMSK          (~(((1U << DSP2_GAMMA_C93_PRE_LEN) - 1) << DSP2_GAMMA_C93_PRE_POS))
#define DSP2_GAMMA_C94_PRE               DSP2_GAMMA_C94_PRE
#define DSP2_GAMMA_C94_PRE_POS           (16U)
#define DSP2_GAMMA_C94_PRE_LEN           (8U)
#define DSP2_GAMMA_C94_PRE_MSK           (((1U << DSP2_GAMMA_C94_PRE_LEN) - 1) << DSP2_GAMMA_C94_PRE_POS)
#define DSP2_GAMMA_C94_PRE_UMSK          (~(((1U << DSP2_GAMMA_C94_PRE_LEN) - 1) << DSP2_GAMMA_C94_PRE_POS))
#define DSP2_GAMMA_C95_PRE               DSP2_GAMMA_C95_PRE
#define DSP2_GAMMA_C95_PRE_POS           (24U)
#define DSP2_GAMMA_C95_PRE_LEN           (8U)
#define DSP2_GAMMA_C95_PRE_MSK           (((1U << DSP2_GAMMA_C95_PRE_LEN) - 1) << DSP2_GAMMA_C95_PRE_POS)
#define DSP2_GAMMA_C95_PRE_UMSK          (~(((1U << DSP2_GAMMA_C95_PRE_LEN) - 1) << DSP2_GAMMA_C95_PRE_POS))

