RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_gamma_reg.h
/* 0x760 : GAMMA_CRUVE_25 */
#define DSP2_GAMMA_GAMMA_CRUVE_25_OFFSET (0x760)
#define DSP2_GAMMA_C96_PRE               DSP2_GAMMA_C96_PRE
#define DSP2_GAMMA_C96_PRE_POS           (0U)
#define DSP2_GAMMA_C96_PRE_LEN           (8U)
#define DSP2_GAMMA_C96_PRE_MSK           (((1U << DSP2_GAMMA_C96_PRE_LEN) - 1) << DSP2_GAMMA_C96_PRE_POS)
#define DSP2_GAMMA_C96_PRE_UMSK          (~(((1U << DSP2_GAMMA_C96_PRE_LEN) - 1) << DSP2_GAMMA_C96_PRE_POS))
#define DSP2_GAMMA_C97_PRE               DSP2_GAMMA_C97_PRE
#define DSP2_GAMMA_C97_PRE_POS           (8U)
#define DSP2_GAMMA_C97_PRE_LEN           (8U)
#define DSP2_GAMMA_C97_PRE_MSK           (((1U << DSP2_GAMMA_C97_PRE_LEN) - 1) << DSP2_GAMMA_C97_PRE_POS)
#define DSP2_GAMMA_C97_PRE_UMSK          (~(((1U << DSP2_GAMMA_C97_PRE_LEN) - 1) << DSP2_GAMMA_C97_PRE_POS))
#define DSP2_GAMMA_C98_PRE               DSP2_GAMMA_C98_PRE
#define DSP2_GAMMA_C98_PRE_POS           (16U)
#define DSP2_GAMMA_C98_PRE_LEN           (8U)
#define DSP2_GAMMA_C98_PRE_MSK           (((1U << DSP2_GAMMA_C98_PRE_LEN) - 1) << DSP2_GAMMA_C98_PRE_POS)
#define DSP2_GAMMA_C98_PRE_UMSK          (~(((1U << DSP2_GAMMA_C98_PRE_LEN) - 1) << DSP2_GAMMA_C98_PRE_POS))
#define DSP2_GAMMA_C99_PRE               DSP2_GAMMA_C99_PRE
#define DSP2_GAMMA_C99_PRE_POS           (24U)
#define DSP2_GAMMA_C99_PRE_LEN           (8U)
#define DSP2_GAMMA_C99_PRE_MSK           (((1U << DSP2_GAMMA_C99_PRE_LEN) - 1) << DSP2_GAMMA_C99_PRE_POS)
#define DSP2_GAMMA_C99_PRE_UMSK          (~(((1U << DSP2_GAMMA_C99_PRE_LEN) - 1) << DSP2_GAMMA_C99_PRE_POS))

/* 0x764 : GAMMA_CRUVE_26 */
#define DSP2_GAMMA_GAMMA_CRUVE_26_OFFSET (0x764)
#define DSP2_GAMMA_C100_PRE              DSP2_GAMMA_C100_PRE
#define DSP2_GAMMA_C100_PRE_POS          (0U)
#define DSP2_GAMMA_C100_PRE_LEN          (8U)
#define DSP2_GAMMA_C100_PRE_MSK          (((1U << DSP2_GAMMA_C100_PRE_LEN) - 1) << DSP2_GAMMA_C100_PRE_POS)
#define DSP2_GAMMA_C100_PRE_UMSK         (~(((1U << DSP2_GAMMA_C100_PRE_LEN) - 1) << DSP2_GAMMA_C100_PRE_POS))
#define DSP2_GAMMA_C101_PRE              DSP2_GAMMA_C101_PRE
#define DSP2_GAMMA_C101_PRE_POS          (8U)
#define DSP2_GAMMA_C101_PRE_LEN          (8U)
#define DSP2_GAMMA_C101_PRE_MSK          (((1U << DSP2_GAMMA_C101_PRE_LEN) - 1) << DSP2_GAMMA_C101_PRE_POS)
#define DSP2_GAMMA_C101_PRE_UMSK         (~(((1U << DSP2_GAMMA_C101_PRE_LEN) - 1) << DSP2_GAMMA_C101_PRE_POS))
#define DSP2_GAMMA_C102_PRE              DSP2_GAMMA_C102_PRE
#define DSP2_GAMMA_C102_PRE_POS          (16U)
#define DSP2_GAMMA_C102_PRE_LEN          (8U)
#define DSP2_GAMMA_C102_PRE_MSK          (((1U << DSP2_GAMMA_C102_PRE_LEN) - 1) << DSP2_GAMMA_C102_PRE_POS)
#define DSP2_GAMMA_C102_PRE_UMSK         (~(((1U << DSP2_GAMMA_C102_PRE_LEN) - 1) << DSP2_GAMMA_C102_PRE_POS))
#define DSP2_GAMMA_C103_PRE              DSP2_GAMMA_C103_PRE
#define DSP2_GAMMA_C103_PRE_POS          (24U)
#define DSP2_GAMMA_C103_PRE_LEN          (8U)
#define DSP2_GAMMA_C103_PRE_MSK          (((1U << DSP2_GAMMA_C103_PRE_LEN) - 1) << DSP2_GAMMA_C103_PRE_POS)
#define DSP2_GAMMA_C103_PRE_UMSK         (~(((1U << DSP2_GAMMA_C103_PRE_LEN) - 1) << DSP2_GAMMA_C103_PRE_POS))

/* 0x768 : GAMMA_CRUVE_27 */
#define DSP2_GAMMA_GAMMA_CRUVE_27_OFFSET (0x768)
#define DSP2_GAMMA_C104_PRE              DSP2_GAMMA_C104_PRE
#define DSP2_GAMMA_C104_PRE_POS          (0U)
#define DSP2_GAMMA_C104_PRE_LEN          (8U)
#define DSP2_GAMMA_C104_PRE_MSK          (((1U << DSP2_GAMMA_C104_PRE_LEN) - 1) << DSP2_GAMMA_C104_PRE_POS)
#define DSP2_GAMMA_C104_PRE_UMSK         (~(((1U << DSP2_GAMMA_C104_PRE_LEN) - 1) << DSP2_GAMMA_C104_PRE_POS))
#define DSP2_GAMMA_C105_PRE              DSP2_GAMMA_C105_PRE
#define DSP2_GAMMA_C105_PRE_POS          (8U)
#define DSP2_GAMMA_C105_PRE_LEN          (8U)
#define DSP2_GAMMA_C105_PRE_MSK          (((1U << DSP2_GAMMA_C105_PRE_LEN) - 1) << DSP2_GAMMA_C105_PRE_POS)
#define DSP2_GAMMA_C105_PRE_UMSK         (~(((1U << DSP2_GAMMA_C105_PRE_LEN) - 1) << DSP2_GAMMA_C105_PRE_POS))
#define DSP2_GAMMA_C106_PRE              DSP2_GAMMA_C106_PRE
#define DSP2_GAMMA_C106_PRE_POS          (16U)
#define DSP2_GAMMA_C106_PRE_LEN          (8U)
#define DSP2_GAMMA_C106_PRE_MSK          (((1U << DSP2_GAMMA_C106_PRE_LEN) - 1) << DSP2_GAMMA_C106_PRE_POS)
#define DSP2_GAMMA_C106_PRE_UMSK         (~(((1U << DSP2_GAMMA_C106_PRE_LEN) - 1) << DSP2_GAMMA_C106_PRE_POS))
#define DSP2_GAMMA_C107_PRE              DSP2_GAMMA_C107_PRE
#define DSP2_GAMMA_C107_PRE_POS          (24U)
#define DSP2_GAMMA_C107_PRE_LEN          (8U)
#define DSP2_GAMMA_C107_PRE_MSK          (((1U << DSP2_GAMMA_C107_PRE_LEN) - 1) << DSP2_GAMMA_C107_PRE_POS)
#define DSP2_GAMMA_C107_PRE_UMSK         (~(((1U << DSP2_GAMMA_C107_PRE_LEN) - 1) << DSP2_GAMMA_C107_PRE_POS))

/* 0x76C : GAMMA_CRUVE_28 */
#define DSP2_GAMMA_GAMMA_CRUVE_28_OFFSET (0x76C)
#define DSP2_GAMMA_C108_PRE              DSP2_GAMMA_C108_PRE
#define DSP2_GAMMA_C108_PRE_POS          (0U)
#define DSP2_GAMMA_C108_PRE_LEN          (8U)
#define DSP2_GAMMA_C108_PRE_MSK          (((1U << DSP2_GAMMA_C108_PRE_LEN) - 1) << DSP2_GAMMA_C108_PRE_POS)
#define DSP2_GAMMA_C108_PRE_UMSK         (~(((1U << DSP2_GAMMA_C108_PRE_LEN) - 1) << DSP2_GAMMA_C108_PRE_POS))
#define DSP2_GAMMA_C109_PRE              DSP2_GAMMA_C109_PRE
#define DSP2_GAMMA_C109_PRE_POS          (8U)
#define DSP2_GAMMA_C109_PRE_LEN          (8U)
#define DSP2_GAMMA_C109_PRE_MSK          (((1U << DSP2_GAMMA_C109_PRE_LEN) - 1) << DSP2_GAMMA_C109_PRE_POS)
#define DSP2_GAMMA_C109_PRE_UMSK         (~(((1U << DSP2_GAMMA_C109_PRE_LEN) - 1) << DSP2_GAMMA_C109_PRE_POS))
#define DSP2_GAMMA_C110_PRE              DSP2_GAMMA_C110_PRE
#define DSP2_GAMMA_C110_PRE_POS          (16U)
#define DSP2_GAMMA_C110_PRE_LEN          (8U)
#define DSP2_GAMMA_C110_PRE_MSK          (((1U << DSP2_GAMMA_C110_PRE_LEN) - 1) << DSP2_GAMMA_C110_PRE_POS)
#define DSP2_GAMMA_C110_PRE_UMSK         (~(((1U << DSP2_GAMMA_C110_PRE_LEN) - 1) << DSP2_GAMMA_C110_PRE_POS))
#define DSP2_GAMMA_C111_PRE              DSP2_GAMMA_C111_PRE
#define DSP2_GAMMA_C111_PRE_POS          (24U)
#define DSP2_GAMMA_C111_PRE_LEN          (8U)
#define DSP2_GAMMA_C111_PRE_MSK          (((1U << DSP2_GAMMA_C111_PRE_LEN) - 1) << DSP2_GAMMA_C111_PRE_POS)
#define DSP2_GAMMA_C111_PRE_UMSK         (~(((1U << DSP2_GAMMA_C111_PRE_LEN) - 1) << DSP2_GAMMA_C111_PRE_POS))

/* 0x770 : GAMMA_CRUVE_29 */
#define DSP2_GAMMA_GAMMA_CRUVE_29_OFFSET (0x770)
#define DSP2_GAMMA_C112_PRE              DSP2_GAMMA_C112_PRE
#define DSP2_GAMMA_C112_PRE_POS          (0U)
#define DSP2_GAMMA_C112_PRE_LEN          (8U)
#define DSP2_GAMMA_C112_PRE_MSK          (((1U << DSP2_GAMMA_C112_PRE_LEN) - 1) << DSP2_GAMMA_C112_PRE_POS)
#define DSP2_GAMMA_C112_PRE_UMSK         (~(((1U << DSP2_GAMMA_C112_PRE_LEN) - 1) << DSP2_GAMMA_C112_PRE_POS))
#define DSP2_GAMMA_C113_PRE              DSP2_GAMMA_C113_PRE
#define DSP2_GAMMA_C113_PRE_POS          (8U)
#define DSP2_GAMMA_C113_PRE_LEN          (8U)
#define DSP2_GAMMA_C113_PRE_MSK          (((1U << DSP2_GAMMA_C113_PRE_LEN) - 1) << DSP2_GAMMA_C113_PRE_POS)
#define DSP2_GAMMA_C113_PRE_UMSK         (~(((1U << DSP2_GAMMA_C113_PRE_LEN) - 1) << DSP2_GAMMA_C113_PRE_POS))
#define DSP2_GAMMA_C114_PRE              DSP2_GAMMA_C114_PRE
#define DSP2_GAMMA_C114_PRE_POS          (16U)
#define DSP2_GAMMA_C114_PRE_LEN          (8U)
#define DSP2_GAMMA_C114_PRE_MSK          (((1U << DSP2_GAMMA_C114_PRE_LEN) - 1) << DSP2_GAMMA_C114_PRE_POS)
#define DSP2_GAMMA_C114_PRE_UMSK         (~(((1U << DSP2_GAMMA_C114_PRE_LEN) - 1) << DSP2_GAMMA_C114_PRE_POS))
#define DSP2_GAMMA_C115_PRE              DSP2_GAMMA_C115_PRE
#define DSP2_GAMMA_C115_PRE_POS          (24U)
#define DSP2_GAMMA_C115_PRE_LEN          (8U)
#define DSP2_GAMMA_C115_PRE_MSK          (((1U << DSP2_GAMMA_C115_PRE_LEN) - 1) << DSP2_GAMMA_C115_PRE_POS)
#define DSP2_GAMMA_C115_PRE_UMSK         (~(((1U << DSP2_GAMMA_C115_PRE_LEN) - 1) << DSP2_GAMMA_C115_PRE_POS))

