RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_gamma_reg.h
/* 0x774 : GAMMA_CRUVE_30 */
#define DSP2_GAMMA_GAMMA_CRUVE_30_OFFSET (0x774)
#define DSP2_GAMMA_C116_PRE              DSP2_GAMMA_C116_PRE
#define DSP2_GAMMA_C116_PRE_POS          (0U)
#define DSP2_GAMMA_C116_PRE_LEN          (8U)
#define DSP2_GAMMA_C116_PRE_MSK          (((1U << DSP2_GAMMA_C116_PRE_LEN) - 1) << DSP2_GAMMA_C116_PRE_POS)
#define DSP2_GAMMA_C116_PRE_UMSK         (~(((1U << DSP2_GAMMA_C116_PRE_LEN) - 1) << DSP2_GAMMA_C116_PRE_POS))
#define DSP2_GAMMA_C117_PRE              DSP2_GAMMA_C117_PRE
#define DSP2_GAMMA_C117_PRE_POS          (8U)
#define DSP2_GAMMA_C117_PRE_LEN          (8U)
#define DSP2_GAMMA_C117_PRE_MSK          (((1U << DSP2_GAMMA_C117_PRE_LEN) - 1) << DSP2_GAMMA_C117_PRE_POS)
#define DSP2_GAMMA_C117_PRE_UMSK         (~(((1U << DSP2_GAMMA_C117_PRE_LEN) - 1) << DSP2_GAMMA_C117_PRE_POS))
#define DSP2_GAMMA_C118_PRE              DSP2_GAMMA_C118_PRE
#define DSP2_GAMMA_C118_PRE_POS          (16U)
#define DSP2_GAMMA_C118_PRE_LEN          (8U)
#define DSP2_GAMMA_C118_PRE_MSK          (((1U << DSP2_GAMMA_C118_PRE_LEN) - 1) << DSP2_GAMMA_C118_PRE_POS)
#define DSP2_GAMMA_C118_PRE_UMSK         (~(((1U << DSP2_GAMMA_C118_PRE_LEN) - 1) << DSP2_GAMMA_C118_PRE_POS))
#define DSP2_GAMMA_C119_PRE              DSP2_GAMMA_C119_PRE
#define DSP2_GAMMA_C119_PRE_POS          (24U)
#define DSP2_GAMMA_C119_PRE_LEN          (8U)
#define DSP2_GAMMA_C119_PRE_MSK          (((1U << DSP2_GAMMA_C119_PRE_LEN) - 1) << DSP2_GAMMA_C119_PRE_POS)
#define DSP2_GAMMA_C119_PRE_UMSK         (~(((1U << DSP2_GAMMA_C119_PRE_LEN) - 1) << DSP2_GAMMA_C119_PRE_POS))

/* 0x778 : GAMMA_CRUVE_31 */
#define DSP2_GAMMA_GAMMA_CRUVE_31_OFFSET (0x778)
#define DSP2_GAMMA_C120_PRE              DSP2_GAMMA_C120_PRE
#define DSP2_GAMMA_C120_PRE_POS          (0U)
#define DSP2_GAMMA_C120_PRE_LEN          (8U)
#define DSP2_GAMMA_C120_PRE_MSK          (((1U << DSP2_GAMMA_C120_PRE_LEN) - 1) << DSP2_GAMMA_C120_PRE_POS)
#define DSP2_GAMMA_C120_PRE_UMSK         (~(((1U << DSP2_GAMMA_C120_PRE_LEN) - 1) << DSP2_GAMMA_C120_PRE_POS))
#define DSP2_GAMMA_C121_PRE              DSP2_GAMMA_C121_PRE
#define DSP2_GAMMA_C121_PRE_POS          (8U)
#define DSP2_GAMMA_C121_PRE_LEN          (8U)
#define DSP2_GAMMA_C121_PRE_MSK          (((1U << DSP2_GAMMA_C121_PRE_LEN) - 1) << DSP2_GAMMA_C121_PRE_POS)
#define DSP2_GAMMA_C121_PRE_UMSK         (~(((1U << DSP2_GAMMA_C121_PRE_LEN) - 1) << DSP2_GAMMA_C121_PRE_POS))
#define DSP2_GAMMA_C122_PRE              DSP2_GAMMA_C122_PRE
#define DSP2_GAMMA_C122_PRE_POS          (16U)
#define DSP2_GAMMA_C122_PRE_LEN          (8U)
#define DSP2_GAMMA_C122_PRE_MSK          (((1U << DSP2_GAMMA_C122_PRE_LEN) - 1) << DSP2_GAMMA_C122_PRE_POS)
#define DSP2_GAMMA_C122_PRE_UMSK         (~(((1U << DSP2_GAMMA_C122_PRE_LEN) - 1) << DSP2_GAMMA_C122_PRE_POS))
#define DSP2_GAMMA_C123_PRE              DSP2_GAMMA_C123_PRE
#define DSP2_GAMMA_C123_PRE_POS          (24U)
#define DSP2_GAMMA_C123_PRE_LEN          (8U)
#define DSP2_GAMMA_C123_PRE_MSK          (((1U << DSP2_GAMMA_C123_PRE_LEN) - 1) << DSP2_GAMMA_C123_PRE_POS)
#define DSP2_GAMMA_C123_PRE_UMSK         (~(((1U << DSP2_GAMMA_C123_PRE_LEN) - 1) << DSP2_GAMMA_C123_PRE_POS))

/* 0x77C : GAMMA_CRUVE_32 */
#define DSP2_GAMMA_GAMMA_CRUVE_32_OFFSET (0x77C)
#define DSP2_GAMMA_C124_PRE              DSP2_GAMMA_C124_PRE
#define DSP2_GAMMA_C124_PRE_POS          (0U)
#define DSP2_GAMMA_C124_PRE_LEN          (8U)
#define DSP2_GAMMA_C124_PRE_MSK          (((1U << DSP2_GAMMA_C124_PRE_LEN) - 1) << DSP2_GAMMA_C124_PRE_POS)
#define DSP2_GAMMA_C124_PRE_UMSK         (~(((1U << DSP2_GAMMA_C124_PRE_LEN) - 1) << DSP2_GAMMA_C124_PRE_POS))
#define DSP2_GAMMA_C125_PRE              DSP2_GAMMA_C125_PRE
#define DSP2_GAMMA_C125_PRE_POS          (8U)
#define DSP2_GAMMA_C125_PRE_LEN          (8U)
#define DSP2_GAMMA_C125_PRE_MSK          (((1U << DSP2_GAMMA_C125_PRE_LEN) - 1) << DSP2_GAMMA_C125_PRE_POS)
#define DSP2_GAMMA_C125_PRE_UMSK         (~(((1U << DSP2_GAMMA_C125_PRE_LEN) - 1) << DSP2_GAMMA_C125_PRE_POS))
#define DSP2_GAMMA_C126_PRE              DSP2_GAMMA_C126_PRE
#define DSP2_GAMMA_C126_PRE_POS          (16U)
#define DSP2_GAMMA_C126_PRE_LEN          (8U)
#define DSP2_GAMMA_C126_PRE_MSK          (((1U << DSP2_GAMMA_C126_PRE_LEN) - 1) << DSP2_GAMMA_C126_PRE_POS)
#define DSP2_GAMMA_C126_PRE_UMSK         (~(((1U << DSP2_GAMMA_C126_PRE_LEN) - 1) << DSP2_GAMMA_C126_PRE_POS))
#define DSP2_GAMMA_C127_PRE              DSP2_GAMMA_C127_PRE
#define DSP2_GAMMA_C127_PRE_POS          (24U)
#define DSP2_GAMMA_C127_PRE_LEN          (8U)
#define DSP2_GAMMA_C127_PRE_MSK          (((1U << DSP2_GAMMA_C127_PRE_LEN) - 1) << DSP2_GAMMA_C127_PRE_POS)
#define DSP2_GAMMA_C127_PRE_UMSK         (~(((1U << DSP2_GAMMA_C127_PRE_LEN) - 1) << DSP2_GAMMA_C127_PRE_POS))

/* 0x780 : GAMMA_CRUVE_33 */
#define DSP2_GAMMA_GAMMA_CRUVE_33_OFFSET (0x780)
#define DSP2_GAMMA_C128_PRE              DSP2_GAMMA_C128_PRE
#define DSP2_GAMMA_C128_PRE_POS          (0U)
#define DSP2_GAMMA_C128_PRE_LEN          (8U)
#define DSP2_GAMMA_C128_PRE_MSK          (((1U << DSP2_GAMMA_C128_PRE_LEN) - 1) << DSP2_GAMMA_C128_PRE_POS)
#define DSP2_GAMMA_C128_PRE_UMSK         (~(((1U << DSP2_GAMMA_C128_PRE_LEN) - 1) << DSP2_GAMMA_C128_PRE_POS))
#define DSP2_GAMMA_C129_PRE              DSP2_GAMMA_C129_PRE
#define DSP2_GAMMA_C129_PRE_POS          (8U)
#define DSP2_GAMMA_C129_PRE_LEN          (8U)
#define DSP2_GAMMA_C129_PRE_MSK          (((1U << DSP2_GAMMA_C129_PRE_LEN) - 1) << DSP2_GAMMA_C129_PRE_POS)
#define DSP2_GAMMA_C129_PRE_UMSK         (~(((1U << DSP2_GAMMA_C129_PRE_LEN) - 1) << DSP2_GAMMA_C129_PRE_POS))
#define DSP2_GAMMA_C130_PRE              DSP2_GAMMA_C130_PRE
#define DSP2_GAMMA_C130_PRE_POS          (16U)
#define DSP2_GAMMA_C130_PRE_LEN          (8U)
#define DSP2_GAMMA_C130_PRE_MSK          (((1U << DSP2_GAMMA_C130_PRE_LEN) - 1) << DSP2_GAMMA_C130_PRE_POS)
#define DSP2_GAMMA_C130_PRE_UMSK         (~(((1U << DSP2_GAMMA_C130_PRE_LEN) - 1) << DSP2_GAMMA_C130_PRE_POS))
#define DSP2_GAMMA_C131_PRE              DSP2_GAMMA_C131_PRE
#define DSP2_GAMMA_C131_PRE_POS          (24U)
#define DSP2_GAMMA_C131_PRE_LEN          (8U)
#define DSP2_GAMMA_C131_PRE_MSK          (((1U << DSP2_GAMMA_C131_PRE_LEN) - 1) << DSP2_GAMMA_C131_PRE_POS)
#define DSP2_GAMMA_C131_PRE_UMSK         (~(((1U << DSP2_GAMMA_C131_PRE_LEN) - 1) << DSP2_GAMMA_C131_PRE_POS))

/* 0x784 : GAMMA_CRUVE_34 */
#define DSP2_GAMMA_GAMMA_CRUVE_34_OFFSET (0x784)
#define DSP2_GAMMA_C132_PRE              DSP2_GAMMA_C132_PRE
#define DSP2_GAMMA_C132_PRE_POS          (0U)
#define DSP2_GAMMA_C132_PRE_LEN          (8U)
#define DSP2_GAMMA_C132_PRE_MSK          (((1U << DSP2_GAMMA_C132_PRE_LEN) - 1) << DSP2_GAMMA_C132_PRE_POS)
#define DSP2_GAMMA_C132_PRE_UMSK         (~(((1U << DSP2_GAMMA_C132_PRE_LEN) - 1) << DSP2_GAMMA_C132_PRE_POS))
#define DSP2_GAMMA_C133_PRE              DSP2_GAMMA_C133_PRE
#define DSP2_GAMMA_C133_PRE_POS          (8U)
#define DSP2_GAMMA_C133_PRE_LEN          (8U)
#define DSP2_GAMMA_C133_PRE_MSK          (((1U << DSP2_GAMMA_C133_PRE_LEN) - 1) << DSP2_GAMMA_C133_PRE_POS)
#define DSP2_GAMMA_C133_PRE_UMSK         (~(((1U << DSP2_GAMMA_C133_PRE_LEN) - 1) << DSP2_GAMMA_C133_PRE_POS))
#define DSP2_GAMMA_C134_PRE              DSP2_GAMMA_C134_PRE
#define DSP2_GAMMA_C134_PRE_POS          (16U)
#define DSP2_GAMMA_C134_PRE_LEN          (8U)
#define DSP2_GAMMA_C134_PRE_MSK          (((1U << DSP2_GAMMA_C134_PRE_LEN) - 1) << DSP2_GAMMA_C134_PRE_POS)
#define DSP2_GAMMA_C134_PRE_UMSK         (~(((1U << DSP2_GAMMA_C134_PRE_LEN) - 1) << DSP2_GAMMA_C134_PRE_POS))
#define DSP2_GAMMA_C135_PRE              DSP2_GAMMA_C135_PRE
#define DSP2_GAMMA_C135_PRE_POS          (24U)
#define DSP2_GAMMA_C135_PRE_LEN          (8U)
#define DSP2_GAMMA_C135_PRE_MSK          (((1U << DSP2_GAMMA_C135_PRE_LEN) - 1) << DSP2_GAMMA_C135_PRE_POS)
#define DSP2_GAMMA_C135_PRE_UMSK         (~(((1U << DSP2_GAMMA_C135_PRE_LEN) - 1) << DSP2_GAMMA_C135_PRE_POS))

/* 0x788 : GAMMA_CRUVE_35 */
#define DSP2_GAMMA_GAMMA_CRUVE_35_OFFSET (0x788)
#define DSP2_GAMMA_C136_PRE              DSP2_GAMMA_C136_PRE
#define DSP2_GAMMA_C136_PRE_POS          (0U)
#define DSP2_GAMMA_C136_PRE_LEN          (8U)
#define DSP2_GAMMA_C136_PRE_MSK          (((1U << DSP2_GAMMA_C136_PRE_LEN) - 1) << DSP2_GAMMA_C136_PRE_POS)
#define DSP2_GAMMA_C136_PRE_UMSK         (~(((1U << DSP2_GAMMA_C136_PRE_LEN) - 1) << DSP2_GAMMA_C136_PRE_POS))
#define DSP2_GAMMA_C137_PRE              DSP2_GAMMA_C137_PRE
#define DSP2_GAMMA_C137_PRE_POS          (8U)
#define DSP2_GAMMA_C137_PRE_LEN          (8U)
#define DSP2_GAMMA_C137_PRE_MSK          (((1U << DSP2_GAMMA_C137_PRE_LEN) - 1) << DSP2_GAMMA_C137_PRE_POS)
#define DSP2_GAMMA_C137_PRE_UMSK         (~(((1U << DSP2_GAMMA_C137_PRE_LEN) - 1) << DSP2_GAMMA_C137_PRE_POS))
#define DSP2_GAMMA_C138_PRE              DSP2_GAMMA_C138_PRE
#define DSP2_GAMMA_C138_PRE_POS          (16U)
#define DSP2_GAMMA_C138_PRE_LEN          (8U)
#define DSP2_GAMMA_C138_PRE_MSK          (((1U << DSP2_GAMMA_C138_PRE_LEN) - 1) << DSP2_GAMMA_C138_PRE_POS)
#define DSP2_GAMMA_C138_PRE_UMSK         (~(((1U << DSP2_GAMMA_C138_PRE_LEN) - 1) << DSP2_GAMMA_C138_PRE_POS))
#define DSP2_GAMMA_C139_PRE              DSP2_GAMMA_C139_PRE
#define DSP2_GAMMA_C139_PRE_POS          (24U)
#define DSP2_GAMMA_C139_PRE_LEN          (8U)
#define DSP2_GAMMA_C139_PRE_MSK          (((1U << DSP2_GAMMA_C139_PRE_LEN) - 1) << DSP2_GAMMA_C139_PRE_POS)
#define DSP2_GAMMA_C139_PRE_UMSK         (~(((1U << DSP2_GAMMA_C139_PRE_LEN) - 1) << DSP2_GAMMA_C139_PRE_POS))

/* 0x78C : GAMMA_CRUVE_36 */
#define DSP2_GAMMA_GAMMA_CRUVE_36_OFFSET (0x78C)
#define DSP2_GAMMA_C140_PRE              DSP2_GAMMA_C140_PRE
#define DSP2_GAMMA_C140_PRE_POS          (0U)
#define DSP2_GAMMA_C140_PRE_LEN          (8U)
#define DSP2_GAMMA_C140_PRE_MSK          (((1U << DSP2_GAMMA_C140_PRE_LEN) - 1) << DSP2_GAMMA_C140_PRE_POS)
#define DSP2_GAMMA_C140_PRE_UMSK         (~(((1U << DSP2_GAMMA_C140_PRE_LEN) - 1) << DSP2_GAMMA_C140_PRE_POS))
#define DSP2_GAMMA_C141_PRE              DSP2_GAMMA_C141_PRE
#define DSP2_GAMMA_C141_PRE_POS          (8U)
#define DSP2_GAMMA_C141_PRE_LEN          (8U)
#define DSP2_GAMMA_C141_PRE_MSK          (((1U << DSP2_GAMMA_C141_PRE_LEN) - 1) << DSP2_GAMMA_C141_PRE_POS)
#define DSP2_GAMMA_C141_PRE_UMSK         (~(((1U << DSP2_GAMMA_C141_PRE_LEN) - 1) << DSP2_GAMMA_C141_PRE_POS))
#define DSP2_GAMMA_C142_PRE              DSP2_GAMMA_C142_PRE
#define DSP2_GAMMA_C142_PRE_POS          (16U)
#define DSP2_GAMMA_C142_PRE_LEN          (8U)
#define DSP2_GAMMA_C142_PRE_MSK          (((1U << DSP2_GAMMA_C142_PRE_LEN) - 1) << DSP2_GAMMA_C142_PRE_POS)
#define DSP2_GAMMA_C142_PRE_UMSK         (~(((1U << DSP2_GAMMA_C142_PRE_LEN) - 1) << DSP2_GAMMA_C142_PRE_POS))
#define DSP2_GAMMA_C143_PRE              DSP2_GAMMA_C143_PRE
#define DSP2_GAMMA_C143_PRE_POS          (24U)
#define DSP2_GAMMA_C143_PRE_LEN          (8U)
#define DSP2_GAMMA_C143_PRE_MSK          (((1U << DSP2_GAMMA_C143_PRE_LEN) - 1) << DSP2_GAMMA_C143_PRE_POS)
#define DSP2_GAMMA_C143_PRE_UMSK         (~(((1U << DSP2_GAMMA_C143_PRE_LEN) - 1) << DSP2_GAMMA_C143_PRE_POS))

/* 0x790 : GAMMA_CRUVE_37 */
#define DSP2_GAMMA_GAMMA_CRUVE_37_OFFSET (0x790)
#define DSP2_GAMMA_C144_PRE              DSP2_GAMMA_C144_PRE
#define DSP2_GAMMA_C144_PRE_POS          (0U)
#define DSP2_GAMMA_C144_PRE_LEN          (8U)
#define DSP2_GAMMA_C144_PRE_MSK          (((1U << DSP2_GAMMA_C144_PRE_LEN) - 1) << DSP2_GAMMA_C144_PRE_POS)
#define DSP2_GAMMA_C144_PRE_UMSK         (~(((1U << DSP2_GAMMA_C144_PRE_LEN) - 1) << DSP2_GAMMA_C144_PRE_POS))
#define DSP2_GAMMA_C145_PRE              DSP2_GAMMA_C145_PRE
#define DSP2_GAMMA_C145_PRE_POS          (8U)
#define DSP2_GAMMA_C145_PRE_LEN          (8U)
#define DSP2_GAMMA_C145_PRE_MSK          (((1U << DSP2_GAMMA_C145_PRE_LEN) - 1) << DSP2_GAMMA_C145_PRE_POS)
#define DSP2_GAMMA_C145_PRE_UMSK         (~(((1U << DSP2_GAMMA_C145_PRE_LEN) - 1) << DSP2_GAMMA_C145_PRE_POS))
#define DSP2_GAMMA_C146_PRE              DSP2_GAMMA_C146_PRE
#define DSP2_GAMMA_C146_PRE_POS          (16U)
#define DSP2_GAMMA_C146_PRE_LEN          (8U)
#define DSP2_GAMMA_C146_PRE_MSK          (((1U << DSP2_GAMMA_C146_PRE_LEN) - 1) << DSP2_GAMMA_C146_PRE_POS)
#define DSP2_GAMMA_C146_PRE_UMSK         (~(((1U << DSP2_GAMMA_C146_PRE_LEN) - 1) << DSP2_GAMMA_C146_PRE_POS))
#define DSP2_GAMMA_C147_PRE              DSP2_GAMMA_C147_PRE
#define DSP2_GAMMA_C147_PRE_POS          (24U)
#define DSP2_GAMMA_C147_PRE_LEN          (8U)
#define DSP2_GAMMA_C147_PRE_MSK          (((1U << DSP2_GAMMA_C147_PRE_LEN) - 1) << DSP2_GAMMA_C147_PRE_POS)
#define DSP2_GAMMA_C147_PRE_UMSK         (~(((1U << DSP2_GAMMA_C147_PRE_LEN) - 1) << DSP2_GAMMA_C147_PRE_POS))

/* 0x794 : GAMMA_CRUVE_38 */
#define DSP2_GAMMA_GAMMA_CRUVE_38_OFFSET (0x794)
#define DSP2_GAMMA_C148_PRE              DSP2_GAMMA_C148_PRE
#define DSP2_GAMMA_C148_PRE_POS          (0U)
#define DSP2_GAMMA_C148_PRE_LEN          (8U)
#define DSP2_GAMMA_C148_PRE_MSK          (((1U << DSP2_GAMMA_C148_PRE_LEN) - 1) << DSP2_GAMMA_C148_PRE_POS)
#define DSP2_GAMMA_C148_PRE_UMSK         (~(((1U << DSP2_GAMMA_C148_PRE_LEN) - 1) << DSP2_GAMMA_C148_PRE_POS))
#define DSP2_GAMMA_C149_PRE              DSP2_GAMMA_C149_PRE
#define DSP2_GAMMA_C149_PRE_POS          (8U)
#define DSP2_GAMMA_C149_PRE_LEN          (8U)
#define DSP2_GAMMA_C149_PRE_MSK          (((1U << DSP2_GAMMA_C149_PRE_LEN) - 1) << DSP2_GAMMA_C149_PRE_POS)
#define DSP2_GAMMA_C149_PRE_UMSK         (~(((1U << DSP2_GAMMA_C149_PRE_LEN) - 1) << DSP2_GAMMA_C149_PRE_POS))
#define DSP2_GAMMA_C150_PRE              DSP2_GAMMA_C150_PRE
#define DSP2_GAMMA_C150_PRE_POS          (16U)
#define DSP2_GAMMA_C150_PRE_LEN          (8U)
#define DSP2_GAMMA_C150_PRE_MSK          (((1U << DSP2_GAMMA_C150_PRE_LEN) - 1) << DSP2_GAMMA_C150_PRE_POS)
#define DSP2_GAMMA_C150_PRE_UMSK         (~(((1U << DSP2_GAMMA_C150_PRE_LEN) - 1) << DSP2_GAMMA_C150_PRE_POS))
#define DSP2_GAMMA_C151_PRE              DSP2_GAMMA_C151_PRE
#define DSP2_GAMMA_C151_PRE_POS          (24U)
#define DSP2_GAMMA_C151_PRE_LEN          (8U)
#define DSP2_GAMMA_C151_PRE_MSK          (((1U << DSP2_GAMMA_C151_PRE_LEN) - 1) << DSP2_GAMMA_C151_PRE_POS)
#define DSP2_GAMMA_C151_PRE_UMSK         (~(((1U << DSP2_GAMMA_C151_PRE_LEN) - 1) << DSP2_GAMMA_C151_PRE_POS))

/* 0x798 : GAMMA_CRUVE_39 */
#define DSP2_GAMMA_GAMMA_CRUVE_39_OFFSET (0x798)
#define DSP2_GAMMA_C152_PRE              DSP2_GAMMA_C152_PRE
#define DSP2_GAMMA_C152_PRE_POS          (0U)
#define DSP2_GAMMA_C152_PRE_LEN          (8U)
#define DSP2_GAMMA_C152_PRE_MSK          (((1U << DSP2_GAMMA_C152_PRE_LEN) - 1) << DSP2_GAMMA_C152_PRE_POS)
#define DSP2_GAMMA_C152_PRE_UMSK         (~(((1U << DSP2_GAMMA_C152_PRE_LEN) - 1) << DSP2_GAMMA_C152_PRE_POS))
#define DSP2_GAMMA_C153_PRE              DSP2_GAMMA_C153_PRE
#define DSP2_GAMMA_C153_PRE_POS          (8U)
#define DSP2_GAMMA_C153_PRE_LEN          (8U)
#define DSP2_GAMMA_C153_PRE_MSK          (((1U << DSP2_GAMMA_C153_PRE_LEN) - 1) << DSP2_GAMMA_C153_PRE_POS)
#define DSP2_GAMMA_C153_PRE_UMSK         (~(((1U << DSP2_GAMMA_C153_PRE_LEN) - 1) << DSP2_GAMMA_C153_PRE_POS))
#define DSP2_GAMMA_C154_PRE              DSP2_GAMMA_C154_PRE
#define DSP2_GAMMA_C154_PRE_POS          (16U)
#define DSP2_GAMMA_C154_PRE_LEN          (8U)
#define DSP2_GAMMA_C154_PRE_MSK          (((1U << DSP2_GAMMA_C154_PRE_LEN) - 1) << DSP2_GAMMA_C154_PRE_POS)
#define DSP2_GAMMA_C154_PRE_UMSK         (~(((1U << DSP2_GAMMA_C154_PRE_LEN) - 1) << DSP2_GAMMA_C154_PRE_POS))
#define DSP2_GAMMA_C155_PRE              DSP2_GAMMA_C155_PRE
#define DSP2_GAMMA_C155_PRE_POS          (24U)
#define DSP2_GAMMA_C155_PRE_LEN          (8U)
#define DSP2_GAMMA_C155_PRE_MSK          (((1U << DSP2_GAMMA_C155_PRE_LEN) - 1) << DSP2_GAMMA_C155_PRE_POS)
#define DSP2_GAMMA_C155_PRE_UMSK         (~(((1U << DSP2_GAMMA_C155_PRE_LEN) - 1) << DSP2_GAMMA_C155_PRE_POS))

/* 0x79C : GAMMA_CRUVE_40 */
#define DSP2_GAMMA_GAMMA_CRUVE_40_OFFSET (0x79C)
#define DSP2_GAMMA_C156_PRE              DSP2_GAMMA_C156_PRE
#define DSP2_GAMMA_C156_PRE_POS          (0U)
#define DSP2_GAMMA_C156_PRE_LEN          (8U)
#define DSP2_GAMMA_C156_PRE_MSK          (((1U << DSP2_GAMMA_C156_PRE_LEN) - 1) << DSP2_GAMMA_C156_PRE_POS)
#define DSP2_GAMMA_C156_PRE_UMSK         (~(((1U << DSP2_GAMMA_C156_PRE_LEN) - 1) << DSP2_GAMMA_C156_PRE_POS))
#define DSP2_GAMMA_C157_PRE              DSP2_GAMMA_C157_PRE
#define DSP2_GAMMA_C157_PRE_POS          (8U)
#define DSP2_GAMMA_C157_PRE_LEN          (8U)
#define DSP2_GAMMA_C157_PRE_MSK          (((1U << DSP2_GAMMA_C157_PRE_LEN) - 1) << DSP2_GAMMA_C157_PRE_POS)
#define DSP2_GAMMA_C157_PRE_UMSK         (~(((1U << DSP2_GAMMA_C157_PRE_LEN) - 1) << DSP2_GAMMA_C157_PRE_POS))
#define DSP2_GAMMA_C158_PRE              DSP2_GAMMA_C158_PRE
#define DSP2_GAMMA_C158_PRE_POS          (16U)
#define DSP2_GAMMA_C158_PRE_LEN          (8U)
#define DSP2_GAMMA_C158_PRE_MSK          (((1U << DSP2_GAMMA_C158_PRE_LEN) - 1) << DSP2_GAMMA_C158_PRE_POS)
#define DSP2_GAMMA_C158_PRE_UMSK         (~(((1U << DSP2_GAMMA_C158_PRE_LEN) - 1) << DSP2_GAMMA_C158_PRE_POS))
#define DSP2_GAMMA_C159_PRE              DSP2_GAMMA_C159_PRE
#define DSP2_GAMMA_C159_PRE_POS          (24U)
#define DSP2_GAMMA_C159_PRE_LEN          (8U)
#define DSP2_GAMMA_C159_PRE_MSK          (((1U << DSP2_GAMMA_C159_PRE_LEN) - 1) << DSP2_GAMMA_C159_PRE_POS)
#define DSP2_GAMMA_C159_PRE_UMSK         (~(((1U << DSP2_GAMMA_C159_PRE_LEN) - 1) << DSP2_GAMMA_C159_PRE_POS))

/* 0x7A0 : GAMMA_CRUVE_41 */
#define DSP2_GAMMA_GAMMA_CRUVE_41_OFFSET (0x7A0)
#define DSP2_GAMMA_C160_PRE              DSP2_GAMMA_C160_PRE
#define DSP2_GAMMA_C160_PRE_POS          (0U)
#define DSP2_GAMMA_C160_PRE_LEN          (8U)
#define DSP2_GAMMA_C160_PRE_MSK          (((1U << DSP2_GAMMA_C160_PRE_LEN) - 1) << DSP2_GAMMA_C160_PRE_POS)
#define DSP2_GAMMA_C160_PRE_UMSK         (~(((1U << DSP2_GAMMA_C160_PRE_LEN) - 1) << DSP2_GAMMA_C160_PRE_POS))
#define DSP2_GAMMA_C161_PRE              DSP2_GAMMA_C161_PRE
#define DSP2_GAMMA_C161_PRE_POS          (8U)
#define DSP2_GAMMA_C161_PRE_LEN          (8U)
#define DSP2_GAMMA_C161_PRE_MSK          (((1U << DSP2_GAMMA_C161_PRE_LEN) - 1) << DSP2_GAMMA_C161_PRE_POS)
#define DSP2_GAMMA_C161_PRE_UMSK         (~(((1U << DSP2_GAMMA_C161_PRE_LEN) - 1) << DSP2_GAMMA_C161_PRE_POS))
#define DSP2_GAMMA_C162_PRE              DSP2_GAMMA_C162_PRE
#define DSP2_GAMMA_C162_PRE_POS          (16U)
#define DSP2_GAMMA_C162_PRE_LEN          (8U)
#define DSP2_GAMMA_C162_PRE_MSK          (((1U << DSP2_GAMMA_C162_PRE_LEN) - 1) << DSP2_GAMMA_C162_PRE_POS)
#define DSP2_GAMMA_C162_PRE_UMSK         (~(((1U << DSP2_GAMMA_C162_PRE_LEN) - 1) << DSP2_GAMMA_C162_PRE_POS))
#define DSP2_GAMMA_C163_PRE              DSP2_GAMMA_C163_PRE
#define DSP2_GAMMA_C163_PRE_POS          (24U)
#define DSP2_GAMMA_C163_PRE_LEN          (8U)
#define DSP2_GAMMA_C163_PRE_MSK          (((1U << DSP2_GAMMA_C163_PRE_LEN) - 1) << DSP2_GAMMA_C163_PRE_POS)
#define DSP2_GAMMA_C163_PRE_UMSK         (~(((1U << DSP2_GAMMA_C163_PRE_LEN) - 1) << DSP2_GAMMA_C163_PRE_POS))

/* 0x7A4 : GAMMA_CRUVE_42 */
#define DSP2_GAMMA_GAMMA_CRUVE_42_OFFSET (0x7A4)
#define DSP2_GAMMA_C164_PRE              DSP2_GAMMA_C164_PRE
#define DSP2_GAMMA_C164_PRE_POS          (0U)
#define DSP2_GAMMA_C164_PRE_LEN          (8U)
#define DSP2_GAMMA_C164_PRE_MSK          (((1U << DSP2_GAMMA_C164_PRE_LEN) - 1) << DSP2_GAMMA_C164_PRE_POS)
#define DSP2_GAMMA_C164_PRE_UMSK         (~(((1U << DSP2_GAMMA_C164_PRE_LEN) - 1) << DSP2_GAMMA_C164_PRE_POS))
#define DSP2_GAMMA_C165_PRE              DSP2_GAMMA_C165_PRE
#define DSP2_GAMMA_C165_PRE_POS          (8U)
#define DSP2_GAMMA_C165_PRE_LEN          (8U)
#define DSP2_GAMMA_C165_PRE_MSK          (((1U << DSP2_GAMMA_C165_PRE_LEN) - 1) << DSP2_GAMMA_C165_PRE_POS)
#define DSP2_GAMMA_C165_PRE_UMSK         (~(((1U << DSP2_GAMMA_C165_PRE_LEN) - 1) << DSP2_GAMMA_C165_PRE_POS))
#define DSP2_GAMMA_C166_PRE              DSP2_GAMMA_C166_PRE
#define DSP2_GAMMA_C166_PRE_POS          (16U)
#define DSP2_GAMMA_C166_PRE_LEN          (8U)
#define DSP2_GAMMA_C166_PRE_MSK          (((1U << DSP2_GAMMA_C166_PRE_LEN) - 1) << DSP2_GAMMA_C166_PRE_POS)
#define DSP2_GAMMA_C166_PRE_UMSK         (~(((1U << DSP2_GAMMA_C166_PRE_LEN) - 1) << DSP2_GAMMA_C166_PRE_POS))
#define DSP2_GAMMA_C167_PRE              DSP2_GAMMA_C167_PRE
#define DSP2_GAMMA_C167_PRE_POS          (24U)
#define DSP2_GAMMA_C167_PRE_LEN          (8U)
#define DSP2_GAMMA_C167_PRE_MSK          (((1U << DSP2_GAMMA_C167_PRE_LEN) - 1) << DSP2_GAMMA_C167_PRE_POS)
#define DSP2_GAMMA_C167_PRE_UMSK         (~(((1U << DSP2_GAMMA_C167_PRE_LEN) - 1) << DSP2_GAMMA_C167_PRE_POS))

/* 0x7A8 : GAMMA_CRUVE_43 */
#define DSP2_GAMMA_GAMMA_CRUVE_43_OFFSET (0x7A8)
#define DSP2_GAMMA_C168_PRE              DSP2_GAMMA_C168_PRE
#define DSP2_GAMMA_C168_PRE_POS          (0U)
#define DSP2_GAMMA_C168_PRE_LEN          (8U)
#define DSP2_GAMMA_C168_PRE_MSK          (((1U << DSP2_GAMMA_C168_PRE_LEN) - 1) << DSP2_GAMMA_C168_PRE_POS)
#define DSP2_GAMMA_C168_PRE_UMSK         (~(((1U << DSP2_GAMMA_C168_PRE_LEN) - 1) << DSP2_GAMMA_C168_PRE_POS))
#define DSP2_GAMMA_C169_PRE              DSP2_GAMMA_C169_PRE
#define DSP2_GAMMA_C169_PRE_POS          (8U)
#define DSP2_GAMMA_C169_PRE_LEN          (8U)
#define DSP2_GAMMA_C169_PRE_MSK          (((1U << DSP2_GAMMA_C169_PRE_LEN) - 1) << DSP2_GAMMA_C169_PRE_POS)
#define DSP2_GAMMA_C169_PRE_UMSK         (~(((1U << DSP2_GAMMA_C169_PRE_LEN) - 1) << DSP2_GAMMA_C169_PRE_POS))
#define DSP2_GAMMA_C170_PRE              DSP2_GAMMA_C170_PRE
#define DSP2_GAMMA_C170_PRE_POS          (16U)
#define DSP2_GAMMA_C170_PRE_LEN          (8U)
#define DSP2_GAMMA_C170_PRE_MSK          (((1U << DSP2_GAMMA_C170_PRE_LEN) - 1) << DSP2_GAMMA_C170_PRE_POS)
#define DSP2_GAMMA_C170_PRE_UMSK         (~(((1U << DSP2_GAMMA_C170_PRE_LEN) - 1) << DSP2_GAMMA_C170_PRE_POS))
#define DSP2_GAMMA_C171_PRE              DSP2_GAMMA_C171_PRE
#define DSP2_GAMMA_C171_PRE_POS          (24U)
#define DSP2_GAMMA_C171_PRE_LEN          (8U)
#define DSP2_GAMMA_C171_PRE_MSK          (((1U << DSP2_GAMMA_C171_PRE_LEN) - 1) << DSP2_GAMMA_C171_PRE_POS)
#define DSP2_GAMMA_C171_PRE_UMSK         (~(((1U << DSP2_GAMMA_C171_PRE_LEN) - 1) << DSP2_GAMMA_C171_PRE_POS))

/* 0x7AC : GAMMA_CRUVE_44 */
#define DSP2_GAMMA_GAMMA_CRUVE_44_OFFSET (0x7AC)
#define DSP2_GAMMA_C172_PRE              DSP2_GAMMA_C172_PRE
#define DSP2_GAMMA_C172_PRE_POS          (0U)
#define DSP2_GAMMA_C172_PRE_LEN          (8U)
#define DSP2_GAMMA_C172_PRE_MSK          (((1U << DSP2_GAMMA_C172_PRE_LEN) - 1) << DSP2_GAMMA_C172_PRE_POS)
#define DSP2_GAMMA_C172_PRE_UMSK         (~(((1U << DSP2_GAMMA_C172_PRE_LEN) - 1) << DSP2_GAMMA_C172_PRE_POS))
#define DSP2_GAMMA_C173_PRE              DSP2_GAMMA_C173_PRE
#define DSP2_GAMMA_C173_PRE_POS          (8U)
#define DSP2_GAMMA_C173_PRE_LEN          (8U)
#define DSP2_GAMMA_C173_PRE_MSK          (((1U << DSP2_GAMMA_C173_PRE_LEN) - 1) << DSP2_GAMMA_C173_PRE_POS)
#define DSP2_GAMMA_C173_PRE_UMSK         (~(((1U << DSP2_GAMMA_C173_PRE_LEN) - 1) << DSP2_GAMMA_C173_PRE_POS))
#define DSP2_GAMMA_C174_PRE              DSP2_GAMMA_C174_PRE
#define DSP2_GAMMA_C174_PRE_POS          (16U)
#define DSP2_GAMMA_C174_PRE_LEN          (8U)
#define DSP2_GAMMA_C174_PRE_MSK          (((1U << DSP2_GAMMA_C174_PRE_LEN) - 1) << DSP2_GAMMA_C174_PRE_POS)
#define DSP2_GAMMA_C174_PRE_UMSK         (~(((1U << DSP2_GAMMA_C174_PRE_LEN) - 1) << DSP2_GAMMA_C174_PRE_POS))
#define DSP2_GAMMA_C175_PRE              DSP2_GAMMA_C175_PRE
#define DSP2_GAMMA_C175_PRE_POS          (24U)
#define DSP2_GAMMA_C175_PRE_LEN          (8U)
#define DSP2_GAMMA_C175_PRE_MSK          (((1U << DSP2_GAMMA_C175_PRE_LEN) - 1) << DSP2_GAMMA_C175_PRE_POS)
#define DSP2_GAMMA_C175_PRE_UMSK         (~(((1U << DSP2_GAMMA_C175_PRE_LEN) - 1) << DSP2_GAMMA_C175_PRE_POS))

