RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_gamma_reg.h
/* 0x7B0 : GAMMA_CRUVE_45 */
#define DSP2_GAMMA_GAMMA_CRUVE_45_OFFSET (0x7B0)
#define DSP2_GAMMA_C176_PRE              DSP2_GAMMA_C176_PRE
#define DSP2_GAMMA_C176_PRE_POS          (0U)
#define DSP2_GAMMA_C176_PRE_LEN          (8U)
#define DSP2_GAMMA_C176_PRE_MSK          (((1U << DSP2_GAMMA_C176_PRE_LEN) - 1) << DSP2_GAMMA_C176_PRE_POS)
#define DSP2_GAMMA_C176_PRE_UMSK         (~(((1U << DSP2_GAMMA_C176_PRE_LEN) - 1) << DSP2_GAMMA_C176_PRE_POS))
#define DSP2_GAMMA_C177_PRE              DSP2_GAMMA_C177_PRE
#define DSP2_GAMMA_C177_PRE_POS          (8U)
#define DSP2_GAMMA_C177_PRE_LEN          (8U)
#define DSP2_GAMMA_C177_PRE_MSK          (((1U << DSP2_GAMMA_C177_PRE_LEN) - 1) << DSP2_GAMMA_C177_PRE_POS)
#define DSP2_GAMMA_C177_PRE_UMSK         (~(((1U << DSP2_GAMMA_C177_PRE_LEN) - 1) << DSP2_GAMMA_C177_PRE_POS))
#define DSP2_GAMMA_C178_PRE              DSP2_GAMMA_C178_PRE
#define DSP2_GAMMA_C178_PRE_POS          (16U)
#define DSP2_GAMMA_C178_PRE_LEN          (8U)
#define DSP2_GAMMA_C178_PRE_MSK          (((1U << DSP2_GAMMA_C178_PRE_LEN) - 1) << DSP2_GAMMA_C178_PRE_POS)
#define DSP2_GAMMA_C178_PRE_UMSK         (~(((1U << DSP2_GAMMA_C178_PRE_LEN) - 1) << DSP2_GAMMA_C178_PRE_POS))
#define DSP2_GAMMA_C179_PRE              DSP2_GAMMA_C179_PRE
#define DSP2_GAMMA_C179_PRE_POS          (24U)
#define DSP2_GAMMA_C179_PRE_LEN          (8U)
#define DSP2_GAMMA_C179_PRE_MSK          (((1U << DSP2_GAMMA_C179_PRE_LEN) - 1) << DSP2_GAMMA_C179_PRE_POS)
#define DSP2_GAMMA_C179_PRE_UMSK         (~(((1U << DSP2_GAMMA_C179_PRE_LEN) - 1) << DSP2_GAMMA_C179_PRE_POS))

/* 0x7B4 : GAMMA_CRUVE_46 */
#define DSP2_GAMMA_GAMMA_CRUVE_46_OFFSET (0x7B4)
#define DSP2_GAMMA_C180_PRE              DSP2_GAMMA_C180_PRE
#define DSP2_GAMMA_C180_PRE_POS          (0U)
#define DSP2_GAMMA_C180_PRE_LEN          (8U)
#define DSP2_GAMMA_C180_PRE_MSK          (((1U << DSP2_GAMMA_C180_PRE_LEN) - 1) << DSP2_GAMMA_C180_PRE_POS)
#define DSP2_GAMMA_C180_PRE_UMSK         (~(((1U << DSP2_GAMMA_C180_PRE_LEN) - 1) << DSP2_GAMMA_C180_PRE_POS))
#define DSP2_GAMMA_C181_PRE              DSP2_GAMMA_C181_PRE
#define DSP2_GAMMA_C181_PRE_POS          (8U)
#define DSP2_GAMMA_C181_PRE_LEN          (8U)
#define DSP2_GAMMA_C181_PRE_MSK          (((1U << DSP2_GAMMA_C181_PRE_LEN) - 1) << DSP2_GAMMA_C181_PRE_POS)
#define DSP2_GAMMA_C181_PRE_UMSK         (~(((1U << DSP2_GAMMA_C181_PRE_LEN) - 1) << DSP2_GAMMA_C181_PRE_POS))
#define DSP2_GAMMA_C182_PRE              DSP2_GAMMA_C182_PRE
#define DSP2_GAMMA_C182_PRE_POS          (16U)
#define DSP2_GAMMA_C182_PRE_LEN          (8U)
#define DSP2_GAMMA_C182_PRE_MSK          (((1U << DSP2_GAMMA_C182_PRE_LEN) - 1) << DSP2_GAMMA_C182_PRE_POS)
#define DSP2_GAMMA_C182_PRE_UMSK         (~(((1U << DSP2_GAMMA_C182_PRE_LEN) - 1) << DSP2_GAMMA_C182_PRE_POS))
#define DSP2_GAMMA_C183_PRE              DSP2_GAMMA_C183_PRE
#define DSP2_GAMMA_C183_PRE_POS          (24U)
#define DSP2_GAMMA_C183_PRE_LEN          (8U)
#define DSP2_GAMMA_C183_PRE_MSK          (((1U << DSP2_GAMMA_C183_PRE_LEN) - 1) << DSP2_GAMMA_C183_PRE_POS)
#define DSP2_GAMMA_C183_PRE_UMSK         (~(((1U << DSP2_GAMMA_C183_PRE_LEN) - 1) << DSP2_GAMMA_C183_PRE_POS))

/* 0x7B8 : GAMMA_CRUVE_47 */
#define DSP2_GAMMA_GAMMA_CRUVE_47_OFFSET (0x7B8)
#define DSP2_GAMMA_C184_PRE              DSP2_GAMMA_C184_PRE
#define DSP2_GAMMA_C184_PRE_POS          (0U)
#define DSP2_GAMMA_C184_PRE_LEN          (8U)
#define DSP2_GAMMA_C184_PRE_MSK          (((1U << DSP2_GAMMA_C184_PRE_LEN) - 1) << DSP2_GAMMA_C184_PRE_POS)
#define DSP2_GAMMA_C184_PRE_UMSK         (~(((1U << DSP2_GAMMA_C184_PRE_LEN) - 1) << DSP2_GAMMA_C184_PRE_POS))
#define DSP2_GAMMA_C185_PRE              DSP2_GAMMA_C185_PRE
#define DSP2_GAMMA_C185_PRE_POS          (8U)
#define DSP2_GAMMA_C185_PRE_LEN          (8U)
#define DSP2_GAMMA_C185_PRE_MSK          (((1U << DSP2_GAMMA_C185_PRE_LEN) - 1) << DSP2_GAMMA_C185_PRE_POS)
#define DSP2_GAMMA_C185_PRE_UMSK         (~(((1U << DSP2_GAMMA_C185_PRE_LEN) - 1) << DSP2_GAMMA_C185_PRE_POS))
#define DSP2_GAMMA_C186_PRE              DSP2_GAMMA_C186_PRE
#define DSP2_GAMMA_C186_PRE_POS          (16U)
#define DSP2_GAMMA_C186_PRE_LEN          (8U)
#define DSP2_GAMMA_C186_PRE_MSK          (((1U << DSP2_GAMMA_C186_PRE_LEN) - 1) << DSP2_GAMMA_C186_PRE_POS)
#define DSP2_GAMMA_C186_PRE_UMSK         (~(((1U << DSP2_GAMMA_C186_PRE_LEN) - 1) << DSP2_GAMMA_C186_PRE_POS))
#define DSP2_GAMMA_C187_PRE              DSP2_GAMMA_C187_PRE
#define DSP2_GAMMA_C187_PRE_POS          (24U)
#define DSP2_GAMMA_C187_PRE_LEN          (8U)
#define DSP2_GAMMA_C187_PRE_MSK          (((1U << DSP2_GAMMA_C187_PRE_LEN) - 1) << DSP2_GAMMA_C187_PRE_POS)
#define DSP2_GAMMA_C187_PRE_UMSK         (~(((1U << DSP2_GAMMA_C187_PRE_LEN) - 1) << DSP2_GAMMA_C187_PRE_POS))

/* 0x7BC : GAMMA_CRUVE_48 */
#define DSP2_GAMMA_GAMMA_CRUVE_48_OFFSET (0x7BC)
#define DSP2_GAMMA_C188_PRE              DSP2_GAMMA_C188_PRE
#define DSP2_GAMMA_C188_PRE_POS          (0U)
#define DSP2_GAMMA_C188_PRE_LEN          (8U)
#define DSP2_GAMMA_C188_PRE_MSK          (((1U << DSP2_GAMMA_C188_PRE_LEN) - 1) << DSP2_GAMMA_C188_PRE_POS)
#define DSP2_GAMMA_C188_PRE_UMSK         (~(((1U << DSP2_GAMMA_C188_PRE_LEN) - 1) << DSP2_GAMMA_C188_PRE_POS))
#define DSP2_GAMMA_C189_PRE              DSP2_GAMMA_C189_PRE
#define DSP2_GAMMA_C189_PRE_POS          (8U)
#define DSP2_GAMMA_C189_PRE_LEN          (8U)
#define DSP2_GAMMA_C189_PRE_MSK          (((1U << DSP2_GAMMA_C189_PRE_LEN) - 1) << DSP2_GAMMA_C189_PRE_POS)
#define DSP2_GAMMA_C189_PRE_UMSK         (~(((1U << DSP2_GAMMA_C189_PRE_LEN) - 1) << DSP2_GAMMA_C189_PRE_POS))
#define DSP2_GAMMA_C190_PRE              DSP2_GAMMA_C190_PRE
#define DSP2_GAMMA_C190_PRE_POS          (16U)
#define DSP2_GAMMA_C190_PRE_LEN          (8U)
#define DSP2_GAMMA_C190_PRE_MSK          (((1U << DSP2_GAMMA_C190_PRE_LEN) - 1) << DSP2_GAMMA_C190_PRE_POS)
#define DSP2_GAMMA_C190_PRE_UMSK         (~(((1U << DSP2_GAMMA_C190_PRE_LEN) - 1) << DSP2_GAMMA_C190_PRE_POS))
#define DSP2_GAMMA_C191_PRE              DSP2_GAMMA_C191_PRE
#define DSP2_GAMMA_C191_PRE_POS          (24U)
#define DSP2_GAMMA_C191_PRE_LEN          (8U)
#define DSP2_GAMMA_C191_PRE_MSK          (((1U << DSP2_GAMMA_C191_PRE_LEN) - 1) << DSP2_GAMMA_C191_PRE_POS)
#define DSP2_GAMMA_C191_PRE_UMSK         (~(((1U << DSP2_GAMMA_C191_PRE_LEN) - 1) << DSP2_GAMMA_C191_PRE_POS))

