RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_gamma_reg.h
/* 0x7C0 : GAMMA_CRUVE_49 */
#define DSP2_GAMMA_GAMMA_CRUVE_49_OFFSET (0x7C0)
#define DSP2_GAMMA_C192_PRE              DSP2_GAMMA_C192_PRE
#define DSP2_GAMMA_C192_PRE_POS          (0U)
#define DSP2_GAMMA_C192_PRE_LEN          (8U)
#define DSP2_GAMMA_C192_PRE_MSK          (((1U << DSP2_GAMMA_C192_PRE_LEN) - 1) << DSP2_GAMMA_C192_PRE_POS)
#define DSP2_GAMMA_C192_PRE_UMSK         (~(((1U << DSP2_GAMMA_C192_PRE_LEN) - 1) << DSP2_GAMMA_C192_PRE_POS))
#define DSP2_GAMMA_C193_PRE              DSP2_GAMMA_C193_PRE
#define DSP2_GAMMA_C193_PRE_POS          (8U)
#define DSP2_GAMMA_C193_PRE_LEN          (8U)
#define DSP2_GAMMA_C193_PRE_MSK          (((1U << DSP2_GAMMA_C193_PRE_LEN) - 1) << DSP2_GAMMA_C193_PRE_POS)
#define DSP2_GAMMA_C193_PRE_UMSK         (~(((1U << DSP2_GAMMA_C193_PRE_LEN) - 1) << DSP2_GAMMA_C193_PRE_POS))
#define DSP2_GAMMA_C194_PRE              DSP2_GAMMA_C194_PRE
#define DSP2_GAMMA_C194_PRE_POS          (16U)
#define DSP2_GAMMA_C194_PRE_LEN          (8U)
#define DSP2_GAMMA_C194_PRE_MSK          (((1U << DSP2_GAMMA_C194_PRE_LEN) - 1) << DSP2_GAMMA_C194_PRE_POS)
#define DSP2_GAMMA_C194_PRE_UMSK         (~(((1U << DSP2_GAMMA_C194_PRE_LEN) - 1) << DSP2_GAMMA_C194_PRE_POS))
#define DSP2_GAMMA_C195_PRE              DSP2_GAMMA_C195_PRE
#define DSP2_GAMMA_C195_PRE_POS          (24U)
#define DSP2_GAMMA_C195_PRE_LEN          (8U)
#define DSP2_GAMMA_C195_PRE_MSK          (((1U << DSP2_GAMMA_C195_PRE_LEN) - 1) << DSP2_GAMMA_C195_PRE_POS)
#define DSP2_GAMMA_C195_PRE_UMSK         (~(((1U << DSP2_GAMMA_C195_PRE_LEN) - 1) << DSP2_GAMMA_C195_PRE_POS))

/* 0x7C4 : GAMMA_CRUVE_50 */
#define DSP2_GAMMA_GAMMA_CRUVE_50_OFFSET (0x7C4)
#define DSP2_GAMMA_C196_PRE              DSP2_GAMMA_C196_PRE
#define DSP2_GAMMA_C196_PRE_POS          (0U)
#define DSP2_GAMMA_C196_PRE_LEN          (8U)
#define DSP2_GAMMA_C196_PRE_MSK          (((1U << DSP2_GAMMA_C196_PRE_LEN) - 1) << DSP2_GAMMA_C196_PRE_POS)
#define DSP2_GAMMA_C196_PRE_UMSK         (~(((1U << DSP2_GAMMA_C196_PRE_LEN) - 1) << DSP2_GAMMA_C196_PRE_POS))
#define DSP2_GAMMA_C197_PRE              DSP2_GAMMA_C197_PRE
#define DSP2_GAMMA_C197_PRE_POS          (8U)
#define DSP2_GAMMA_C197_PRE_LEN          (8U)
#define DSP2_GAMMA_C197_PRE_MSK          (((1U << DSP2_GAMMA_C197_PRE_LEN) - 1) << DSP2_GAMMA_C197_PRE_POS)
#define DSP2_GAMMA_C197_PRE_UMSK         (~(((1U << DSP2_GAMMA_C197_PRE_LEN) - 1) << DSP2_GAMMA_C197_PRE_POS))
#define DSP2_GAMMA_C198_PRE              DSP2_GAMMA_C198_PRE
#define DSP2_GAMMA_C198_PRE_POS          (16U)
#define DSP2_GAMMA_C198_PRE_LEN          (8U)
#define DSP2_GAMMA_C198_PRE_MSK          (((1U << DSP2_GAMMA_C198_PRE_LEN) - 1) << DSP2_GAMMA_C198_PRE_POS)
#define DSP2_GAMMA_C198_PRE_UMSK         (~(((1U << DSP2_GAMMA_C198_PRE_LEN) - 1) << DSP2_GAMMA_C198_PRE_POS))
#define DSP2_GAMMA_C199_PRE              DSP2_GAMMA_C199_PRE
#define DSP2_GAMMA_C199_PRE_POS          (24U)
#define DSP2_GAMMA_C199_PRE_LEN          (8U)
#define DSP2_GAMMA_C199_PRE_MSK          (((1U << DSP2_GAMMA_C199_PRE_LEN) - 1) << DSP2_GAMMA_C199_PRE_POS)
#define DSP2_GAMMA_C199_PRE_UMSK         (~(((1U << DSP2_GAMMA_C199_PRE_LEN) - 1) << DSP2_GAMMA_C199_PRE_POS))

/* 0x7C8 : GAMMA_CRUVE_51 */
#define DSP2_GAMMA_GAMMA_CRUVE_51_OFFSET (0x7C8)
#define DSP2_GAMMA_C200_PRE              DSP2_GAMMA_C200_PRE
#define DSP2_GAMMA_C200_PRE_POS          (0U)
#define DSP2_GAMMA_C200_PRE_LEN          (8U)
#define DSP2_GAMMA_C200_PRE_MSK          (((1U << DSP2_GAMMA_C200_PRE_LEN) - 1) << DSP2_GAMMA_C200_PRE_POS)
#define DSP2_GAMMA_C200_PRE_UMSK         (~(((1U << DSP2_GAMMA_C200_PRE_LEN) - 1) << DSP2_GAMMA_C200_PRE_POS))
#define DSP2_GAMMA_C201_PRE              DSP2_GAMMA_C201_PRE
#define DSP2_GAMMA_C201_PRE_POS          (8U)
#define DSP2_GAMMA_C201_PRE_LEN          (8U)
#define DSP2_GAMMA_C201_PRE_MSK          (((1U << DSP2_GAMMA_C201_PRE_LEN) - 1) << DSP2_GAMMA_C201_PRE_POS)
#define DSP2_GAMMA_C201_PRE_UMSK         (~(((1U << DSP2_GAMMA_C201_PRE_LEN) - 1) << DSP2_GAMMA_C201_PRE_POS))
#define DSP2_GAMMA_C202_PRE              DSP2_GAMMA_C202_PRE
#define DSP2_GAMMA_C202_PRE_POS          (16U)
#define DSP2_GAMMA_C202_PRE_LEN          (8U)
#define DSP2_GAMMA_C202_PRE_MSK          (((1U << DSP2_GAMMA_C202_PRE_LEN) - 1) << DSP2_GAMMA_C202_PRE_POS)
#define DSP2_GAMMA_C202_PRE_UMSK         (~(((1U << DSP2_GAMMA_C202_PRE_LEN) - 1) << DSP2_GAMMA_C202_PRE_POS))
#define DSP2_GAMMA_C203_PRE              DSP2_GAMMA_C203_PRE
#define DSP2_GAMMA_C203_PRE_POS          (24U)
#define DSP2_GAMMA_C203_PRE_LEN          (8U)
#define DSP2_GAMMA_C203_PRE_MSK          (((1U << DSP2_GAMMA_C203_PRE_LEN) - 1) << DSP2_GAMMA_C203_PRE_POS)
#define DSP2_GAMMA_C203_PRE_UMSK         (~(((1U << DSP2_GAMMA_C203_PRE_LEN) - 1) << DSP2_GAMMA_C203_PRE_POS))

/* 0x7CC : GAMMA_CRUVE_52 */
#define DSP2_GAMMA_GAMMA_CRUVE_52_OFFSET (0x7CC)
#define DSP2_GAMMA_C204_PRE              DSP2_GAMMA_C204_PRE
#define DSP2_GAMMA_C204_PRE_POS          (0U)
#define DSP2_GAMMA_C204_PRE_LEN          (8U)
#define DSP2_GAMMA_C204_PRE_MSK          (((1U << DSP2_GAMMA_C204_PRE_LEN) - 1) << DSP2_GAMMA_C204_PRE_POS)
#define DSP2_GAMMA_C204_PRE_UMSK         (~(((1U << DSP2_GAMMA_C204_PRE_LEN) - 1) << DSP2_GAMMA_C204_PRE_POS))
#define DSP2_GAMMA_C205_PRE              DSP2_GAMMA_C205_PRE
#define DSP2_GAMMA_C205_PRE_POS          (8U)
#define DSP2_GAMMA_C205_PRE_LEN          (8U)
#define DSP2_GAMMA_C205_PRE_MSK          (((1U << DSP2_GAMMA_C205_PRE_LEN) - 1) << DSP2_GAMMA_C205_PRE_POS)
#define DSP2_GAMMA_C205_PRE_UMSK         (~(((1U << DSP2_GAMMA_C205_PRE_LEN) - 1) << DSP2_GAMMA_C205_PRE_POS))
#define DSP2_GAMMA_C206_PRE              DSP2_GAMMA_C206_PRE
#define DSP2_GAMMA_C206_PRE_POS          (16U)
#define DSP2_GAMMA_C206_PRE_LEN          (8U)
#define DSP2_GAMMA_C206_PRE_MSK          (((1U << DSP2_GAMMA_C206_PRE_LEN) - 1) << DSP2_GAMMA_C206_PRE_POS)
#define DSP2_GAMMA_C206_PRE_UMSK         (~(((1U << DSP2_GAMMA_C206_PRE_LEN) - 1) << DSP2_GAMMA_C206_PRE_POS))
#define DSP2_GAMMA_C207_PRE              DSP2_GAMMA_C207_PRE
#define DSP2_GAMMA_C207_PRE_POS          (24U)
#define DSP2_GAMMA_C207_PRE_LEN          (8U)
#define DSP2_GAMMA_C207_PRE_MSK          (((1U << DSP2_GAMMA_C207_PRE_LEN) - 1) << DSP2_GAMMA_C207_PRE_POS)
#define DSP2_GAMMA_C207_PRE_UMSK         (~(((1U << DSP2_GAMMA_C207_PRE_LEN) - 1) << DSP2_GAMMA_C207_PRE_POS))

