RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_gamma_reg.h
/* 0x7D0 : GAMMA_CRUVE_53 */
#define DSP2_GAMMA_GAMMA_CRUVE_53_OFFSET (0x7D0)
#define DSP2_GAMMA_C208_PRE              DSP2_GAMMA_C208_PRE
#define DSP2_GAMMA_C208_PRE_POS          (0U)
#define DSP2_GAMMA_C208_PRE_LEN          (8U)
#define DSP2_GAMMA_C208_PRE_MSK          (((1U << DSP2_GAMMA_C208_PRE_LEN) - 1) << DSP2_GAMMA_C208_PRE_POS)
#define DSP2_GAMMA_C208_PRE_UMSK         (~(((1U << DSP2_GAMMA_C208_PRE_LEN) - 1) << DSP2_GAMMA_C208_PRE_POS))
#define DSP2_GAMMA_C209_PRE              DSP2_GAMMA_C209_PRE
#define DSP2_GAMMA_C209_PRE_POS          (8U)
#define DSP2_GAMMA_C209_PRE_LEN          (8U)
#define DSP2_GAMMA_C209_PRE_MSK          (((1U << DSP2_GAMMA_C209_PRE_LEN) - 1) << DSP2_GAMMA_C209_PRE_POS)
#define DSP2_GAMMA_C209_PRE_UMSK         (~(((1U << DSP2_GAMMA_C209_PRE_LEN) - 1) << DSP2_GAMMA_C209_PRE_POS))
#define DSP2_GAMMA_C210_PRE              DSP2_GAMMA_C210_PRE
#define DSP2_GAMMA_C210_PRE_POS          (16U)
#define DSP2_GAMMA_C210_PRE_LEN          (8U)
#define DSP2_GAMMA_C210_PRE_MSK          (((1U << DSP2_GAMMA_C210_PRE_LEN) - 1) << DSP2_GAMMA_C210_PRE_POS)
#define DSP2_GAMMA_C210_PRE_UMSK         (~(((1U << DSP2_GAMMA_C210_PRE_LEN) - 1) << DSP2_GAMMA_C210_PRE_POS))
#define DSP2_GAMMA_C211_PRE              DSP2_GAMMA_C211_PRE
#define DSP2_GAMMA_C211_PRE_POS          (24U)
#define DSP2_GAMMA_C211_PRE_LEN          (8U)
#define DSP2_GAMMA_C211_PRE_MSK          (((1U << DSP2_GAMMA_C211_PRE_LEN) - 1) << DSP2_GAMMA_C211_PRE_POS)
#define DSP2_GAMMA_C211_PRE_UMSK         (~(((1U << DSP2_GAMMA_C211_PRE_LEN) - 1) << DSP2_GAMMA_C211_PRE_POS))

/* 0x7D4 : GAMMA_CRUVE_54 */
#define DSP2_GAMMA_GAMMA_CRUVE_54_OFFSET (0x7D4)
#define DSP2_GAMMA_C212_PRE              DSP2_GAMMA_C212_PRE
#define DSP2_GAMMA_C212_PRE_POS          (0U)
#define DSP2_GAMMA_C212_PRE_LEN          (8U)
#define DSP2_GAMMA_C212_PRE_MSK          (((1U << DSP2_GAMMA_C212_PRE_LEN) - 1) << DSP2_GAMMA_C212_PRE_POS)
#define DSP2_GAMMA_C212_PRE_UMSK         (~(((1U << DSP2_GAMMA_C212_PRE_LEN) - 1) << DSP2_GAMMA_C212_PRE_POS))
#define DSP2_GAMMA_C213_PRE              DSP2_GAMMA_C213_PRE
#define DSP2_GAMMA_C213_PRE_POS          (8U)
#define DSP2_GAMMA_C213_PRE_LEN          (8U)
#define DSP2_GAMMA_C213_PRE_MSK          (((1U << DSP2_GAMMA_C213_PRE_LEN) - 1) << DSP2_GAMMA_C213_PRE_POS)
#define DSP2_GAMMA_C213_PRE_UMSK         (~(((1U << DSP2_GAMMA_C213_PRE_LEN) - 1) << DSP2_GAMMA_C213_PRE_POS))
#define DSP2_GAMMA_C214_PRE              DSP2_GAMMA_C214_PRE
#define DSP2_GAMMA_C214_PRE_POS          (16U)
#define DSP2_GAMMA_C214_PRE_LEN          (8U)
#define DSP2_GAMMA_C214_PRE_MSK          (((1U << DSP2_GAMMA_C214_PRE_LEN) - 1) << DSP2_GAMMA_C214_PRE_POS)
#define DSP2_GAMMA_C214_PRE_UMSK         (~(((1U << DSP2_GAMMA_C214_PRE_LEN) - 1) << DSP2_GAMMA_C214_PRE_POS))
#define DSP2_GAMMA_C215_PRE              DSP2_GAMMA_C215_PRE
#define DSP2_GAMMA_C215_PRE_POS          (24U)
#define DSP2_GAMMA_C215_PRE_LEN          (8U)
#define DSP2_GAMMA_C215_PRE_MSK          (((1U << DSP2_GAMMA_C215_PRE_LEN) - 1) << DSP2_GAMMA_C215_PRE_POS)
#define DSP2_GAMMA_C215_PRE_UMSK         (~(((1U << DSP2_GAMMA_C215_PRE_LEN) - 1) << DSP2_GAMMA_C215_PRE_POS))

/* 0x7D8 : GAMMA_CRUVE_55 */
#define DSP2_GAMMA_GAMMA_CRUVE_55_OFFSET (0x7D8)
#define DSP2_GAMMA_C216_PRE              DSP2_GAMMA_C216_PRE
#define DSP2_GAMMA_C216_PRE_POS          (0U)
#define DSP2_GAMMA_C216_PRE_LEN          (8U)
#define DSP2_GAMMA_C216_PRE_MSK          (((1U << DSP2_GAMMA_C216_PRE_LEN) - 1) << DSP2_GAMMA_C216_PRE_POS)
#define DSP2_GAMMA_C216_PRE_UMSK         (~(((1U << DSP2_GAMMA_C216_PRE_LEN) - 1) << DSP2_GAMMA_C216_PRE_POS))
#define DSP2_GAMMA_C217_PRE              DSP2_GAMMA_C217_PRE
#define DSP2_GAMMA_C217_PRE_POS          (8U)
#define DSP2_GAMMA_C217_PRE_LEN          (8U)
#define DSP2_GAMMA_C217_PRE_MSK          (((1U << DSP2_GAMMA_C217_PRE_LEN) - 1) << DSP2_GAMMA_C217_PRE_POS)
#define DSP2_GAMMA_C217_PRE_UMSK         (~(((1U << DSP2_GAMMA_C217_PRE_LEN) - 1) << DSP2_GAMMA_C217_PRE_POS))
#define DSP2_GAMMA_C218_PRE              DSP2_GAMMA_C218_PRE
#define DSP2_GAMMA_C218_PRE_POS          (16U)
#define DSP2_GAMMA_C218_PRE_LEN          (8U)
#define DSP2_GAMMA_C218_PRE_MSK          (((1U << DSP2_GAMMA_C218_PRE_LEN) - 1) << DSP2_GAMMA_C218_PRE_POS)
#define DSP2_GAMMA_C218_PRE_UMSK         (~(((1U << DSP2_GAMMA_C218_PRE_LEN) - 1) << DSP2_GAMMA_C218_PRE_POS))
#define DSP2_GAMMA_C219_PRE              DSP2_GAMMA_C219_PRE
#define DSP2_GAMMA_C219_PRE_POS          (24U)
#define DSP2_GAMMA_C219_PRE_LEN          (8U)
#define DSP2_GAMMA_C219_PRE_MSK          (((1U << DSP2_GAMMA_C219_PRE_LEN) - 1) << DSP2_GAMMA_C219_PRE_POS)
#define DSP2_GAMMA_C219_PRE_UMSK         (~(((1U << DSP2_GAMMA_C219_PRE_LEN) - 1) << DSP2_GAMMA_C219_PRE_POS))

/* 0x7DC : GAMMA_CRUVE_56 */
#define DSP2_GAMMA_GAMMA_CRUVE_56_OFFSET (0x7DC)
#define DSP2_GAMMA_C220_PRE              DSP2_GAMMA_C220_PRE
#define DSP2_GAMMA_C220_PRE_POS          (0U)
#define DSP2_GAMMA_C220_PRE_LEN          (8U)
#define DSP2_GAMMA_C220_PRE_MSK          (((1U << DSP2_GAMMA_C220_PRE_LEN) - 1) << DSP2_GAMMA_C220_PRE_POS)
#define DSP2_GAMMA_C220_PRE_UMSK         (~(((1U << DSP2_GAMMA_C220_PRE_LEN) - 1) << DSP2_GAMMA_C220_PRE_POS))
#define DSP2_GAMMA_C221_PRE              DSP2_GAMMA_C221_PRE
#define DSP2_GAMMA_C221_PRE_POS          (8U)
#define DSP2_GAMMA_C221_PRE_LEN          (8U)
#define DSP2_GAMMA_C221_PRE_MSK          (((1U << DSP2_GAMMA_C221_PRE_LEN) - 1) << DSP2_GAMMA_C221_PRE_POS)
#define DSP2_GAMMA_C221_PRE_UMSK         (~(((1U << DSP2_GAMMA_C221_PRE_LEN) - 1) << DSP2_GAMMA_C221_PRE_POS))
#define DSP2_GAMMA_C222_PRE              DSP2_GAMMA_C222_PRE
#define DSP2_GAMMA_C222_PRE_POS          (16U)
#define DSP2_GAMMA_C222_PRE_LEN          (8U)
#define DSP2_GAMMA_C222_PRE_MSK          (((1U << DSP2_GAMMA_C222_PRE_LEN) - 1) << DSP2_GAMMA_C222_PRE_POS)
#define DSP2_GAMMA_C222_PRE_UMSK         (~(((1U << DSP2_GAMMA_C222_PRE_LEN) - 1) << DSP2_GAMMA_C222_PRE_POS))
#define DSP2_GAMMA_C223_PRE              DSP2_GAMMA_C223_PRE
#define DSP2_GAMMA_C223_PRE_POS          (24U)
#define DSP2_GAMMA_C223_PRE_LEN          (8U)
#define DSP2_GAMMA_C223_PRE_MSK          (((1U << DSP2_GAMMA_C223_PRE_LEN) - 1) << DSP2_GAMMA_C223_PRE_POS)
#define DSP2_GAMMA_C223_PRE_UMSK         (~(((1U << DSP2_GAMMA_C223_PRE_LEN) - 1) << DSP2_GAMMA_C223_PRE_POS))

/* 0x7E0 : GAMMA_CRUVE_57 */
#define DSP2_GAMMA_GAMMA_CRUVE_57_OFFSET (0x7E0)
#define DSP2_GAMMA_C224_PRE              DSP2_GAMMA_C224_PRE
#define DSP2_GAMMA_C224_PRE_POS          (0U)
#define DSP2_GAMMA_C224_PRE_LEN          (8U)
#define DSP2_GAMMA_C224_PRE_MSK          (((1U << DSP2_GAMMA_C224_PRE_LEN) - 1) << DSP2_GAMMA_C224_PRE_POS)
#define DSP2_GAMMA_C224_PRE_UMSK         (~(((1U << DSP2_GAMMA_C224_PRE_LEN) - 1) << DSP2_GAMMA_C224_PRE_POS))
#define DSP2_GAMMA_C225_PRE              DSP2_GAMMA_C225_PRE
#define DSP2_GAMMA_C225_PRE_POS          (8U)
#define DSP2_GAMMA_C225_PRE_LEN          (8U)
#define DSP2_GAMMA_C225_PRE_MSK          (((1U << DSP2_GAMMA_C225_PRE_LEN) - 1) << DSP2_GAMMA_C225_PRE_POS)
#define DSP2_GAMMA_C225_PRE_UMSK         (~(((1U << DSP2_GAMMA_C225_PRE_LEN) - 1) << DSP2_GAMMA_C225_PRE_POS))
#define DSP2_GAMMA_C226_PRE              DSP2_GAMMA_C226_PRE
#define DSP2_GAMMA_C226_PRE_POS          (16U)
#define DSP2_GAMMA_C226_PRE_LEN          (8U)
#define DSP2_GAMMA_C226_PRE_MSK          (((1U << DSP2_GAMMA_C226_PRE_LEN) - 1) << DSP2_GAMMA_C226_PRE_POS)
#define DSP2_GAMMA_C226_PRE_UMSK         (~(((1U << DSP2_GAMMA_C226_PRE_LEN) - 1) << DSP2_GAMMA_C226_PRE_POS))
#define DSP2_GAMMA_C227_PRE              DSP2_GAMMA_C227_PRE
#define DSP2_GAMMA_C227_PRE_POS          (24U)
#define DSP2_GAMMA_C227_PRE_LEN          (8U)
#define DSP2_GAMMA_C227_PRE_MSK          (((1U << DSP2_GAMMA_C227_PRE_LEN) - 1) << DSP2_GAMMA_C227_PRE_POS)
#define DSP2_GAMMA_C227_PRE_UMSK         (~(((1U << DSP2_GAMMA_C227_PRE_LEN) - 1) << DSP2_GAMMA_C227_PRE_POS))

/* 0x7E4 : GAMMA_CRUVE_58 */
#define DSP2_GAMMA_GAMMA_CRUVE_58_OFFSET (0x7E4)
#define DSP2_GAMMA_C228_PRE              DSP2_GAMMA_C228_PRE
#define DSP2_GAMMA_C228_PRE_POS          (0U)
#define DSP2_GAMMA_C228_PRE_LEN          (8U)
#define DSP2_GAMMA_C228_PRE_MSK          (((1U << DSP2_GAMMA_C228_PRE_LEN) - 1) << DSP2_GAMMA_C228_PRE_POS)
#define DSP2_GAMMA_C228_PRE_UMSK         (~(((1U << DSP2_GAMMA_C228_PRE_LEN) - 1) << DSP2_GAMMA_C228_PRE_POS))
#define DSP2_GAMMA_C229_PRE              DSP2_GAMMA_C229_PRE
#define DSP2_GAMMA_C229_PRE_POS          (8U)
#define DSP2_GAMMA_C229_PRE_LEN          (8U)
#define DSP2_GAMMA_C229_PRE_MSK          (((1U << DSP2_GAMMA_C229_PRE_LEN) - 1) << DSP2_GAMMA_C229_PRE_POS)
#define DSP2_GAMMA_C229_PRE_UMSK         (~(((1U << DSP2_GAMMA_C229_PRE_LEN) - 1) << DSP2_GAMMA_C229_PRE_POS))
#define DSP2_GAMMA_C230_PRE              DSP2_GAMMA_C230_PRE
#define DSP2_GAMMA_C230_PRE_POS          (16U)
#define DSP2_GAMMA_C230_PRE_LEN          (8U)
#define DSP2_GAMMA_C230_PRE_MSK          (((1U << DSP2_GAMMA_C230_PRE_LEN) - 1) << DSP2_GAMMA_C230_PRE_POS)
#define DSP2_GAMMA_C230_PRE_UMSK         (~(((1U << DSP2_GAMMA_C230_PRE_LEN) - 1) << DSP2_GAMMA_C230_PRE_POS))
#define DSP2_GAMMA_C231_PRE              DSP2_GAMMA_C231_PRE
#define DSP2_GAMMA_C231_PRE_POS          (24U)
#define DSP2_GAMMA_C231_PRE_LEN          (8U)
#define DSP2_GAMMA_C231_PRE_MSK          (((1U << DSP2_GAMMA_C231_PRE_LEN) - 1) << DSP2_GAMMA_C231_PRE_POS)
#define DSP2_GAMMA_C231_PRE_UMSK         (~(((1U << DSP2_GAMMA_C231_PRE_LEN) - 1) << DSP2_GAMMA_C231_PRE_POS))

/* 0x7E8 : GAMMA_CRUVE_59 */
#define DSP2_GAMMA_GAMMA_CRUVE_59_OFFSET (0x7E8)
#define DSP2_GAMMA_C232_PRE              DSP2_GAMMA_C232_PRE
#define DSP2_GAMMA_C232_PRE_POS          (0U)
#define DSP2_GAMMA_C232_PRE_LEN          (8U)
#define DSP2_GAMMA_C232_PRE_MSK          (((1U << DSP2_GAMMA_C232_PRE_LEN) - 1) << DSP2_GAMMA_C232_PRE_POS)
#define DSP2_GAMMA_C232_PRE_UMSK         (~(((1U << DSP2_GAMMA_C232_PRE_LEN) - 1) << DSP2_GAMMA_C232_PRE_POS))
#define DSP2_GAMMA_C233_PRE              DSP2_GAMMA_C233_PRE
#define DSP2_GAMMA_C233_PRE_POS          (8U)
#define DSP2_GAMMA_C233_PRE_LEN          (8U)
#define DSP2_GAMMA_C233_PRE_MSK          (((1U << DSP2_GAMMA_C233_PRE_LEN) - 1) << DSP2_GAMMA_C233_PRE_POS)
#define DSP2_GAMMA_C233_PRE_UMSK         (~(((1U << DSP2_GAMMA_C233_PRE_LEN) - 1) << DSP2_GAMMA_C233_PRE_POS))
#define DSP2_GAMMA_C234_PRE              DSP2_GAMMA_C234_PRE
#define DSP2_GAMMA_C234_PRE_POS          (16U)
#define DSP2_GAMMA_C234_PRE_LEN          (8U)
#define DSP2_GAMMA_C234_PRE_MSK          (((1U << DSP2_GAMMA_C234_PRE_LEN) - 1) << DSP2_GAMMA_C234_PRE_POS)
#define DSP2_GAMMA_C234_PRE_UMSK         (~(((1U << DSP2_GAMMA_C234_PRE_LEN) - 1) << DSP2_GAMMA_C234_PRE_POS))
#define DSP2_GAMMA_C235_PRE              DSP2_GAMMA_C235_PRE
#define DSP2_GAMMA_C235_PRE_POS          (24U)
#define DSP2_GAMMA_C235_PRE_LEN          (8U)
#define DSP2_GAMMA_C235_PRE_MSK          (((1U << DSP2_GAMMA_C235_PRE_LEN) - 1) << DSP2_GAMMA_C235_PRE_POS)
#define DSP2_GAMMA_C235_PRE_UMSK         (~(((1U << DSP2_GAMMA_C235_PRE_LEN) - 1) << DSP2_GAMMA_C235_PRE_POS))

