RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_gamma_reg.h
/* 0x7EC : GAMMA_CRUVE_60 */
#define DSP2_GAMMA_GAMMA_CRUVE_60_OFFSET (0x7EC)
#define DSP2_GAMMA_C236_PRE              DSP2_GAMMA_C236_PRE
#define DSP2_GAMMA_C236_PRE_POS          (0U)
#define DSP2_GAMMA_C236_PRE_LEN          (8U)
#define DSP2_GAMMA_C236_PRE_MSK          (((1U << DSP2_GAMMA_C236_PRE_LEN) - 1) << DSP2_GAMMA_C236_PRE_POS)
#define DSP2_GAMMA_C236_PRE_UMSK         (~(((1U << DSP2_GAMMA_C236_PRE_LEN) - 1) << DSP2_GAMMA_C236_PRE_POS))
#define DSP2_GAMMA_C237_PRE              DSP2_GAMMA_C237_PRE
#define DSP2_GAMMA_C237_PRE_POS          (8U)
#define DSP2_GAMMA_C237_PRE_LEN          (8U)
#define DSP2_GAMMA_C237_PRE_MSK          (((1U << DSP2_GAMMA_C237_PRE_LEN) - 1) << DSP2_GAMMA_C237_PRE_POS)
#define DSP2_GAMMA_C237_PRE_UMSK         (~(((1U << DSP2_GAMMA_C237_PRE_LEN) - 1) << DSP2_GAMMA_C237_PRE_POS))
#define DSP2_GAMMA_C238_PRE              DSP2_GAMMA_C238_PRE
#define DSP2_GAMMA_C238_PRE_POS          (16U)
#define DSP2_GAMMA_C238_PRE_LEN          (8U)
#define DSP2_GAMMA_C238_PRE_MSK          (((1U << DSP2_GAMMA_C238_PRE_LEN) - 1) << DSP2_GAMMA_C238_PRE_POS)
#define DSP2_GAMMA_C238_PRE_UMSK         (~(((1U << DSP2_GAMMA_C238_PRE_LEN) - 1) << DSP2_GAMMA_C238_PRE_POS))
#define DSP2_GAMMA_C239_PRE              DSP2_GAMMA_C239_PRE
#define DSP2_GAMMA_C239_PRE_POS          (24U)
#define DSP2_GAMMA_C239_PRE_LEN          (8U)
#define DSP2_GAMMA_C239_PRE_MSK          (((1U << DSP2_GAMMA_C239_PRE_LEN) - 1) << DSP2_GAMMA_C239_PRE_POS)
#define DSP2_GAMMA_C239_PRE_UMSK         (~(((1U << DSP2_GAMMA_C239_PRE_LEN) - 1) << DSP2_GAMMA_C239_PRE_POS))

/* 0x7F0 : GAMMA_CRUVE_61 */
#define DSP2_GAMMA_GAMMA_CRUVE_61_OFFSET (0x7F0)
#define DSP2_GAMMA_C240_PRE              DSP2_GAMMA_C240_PRE
#define DSP2_GAMMA_C240_PRE_POS          (0U)
#define DSP2_GAMMA_C240_PRE_LEN          (8U)
#define DSP2_GAMMA_C240_PRE_MSK          (((1U << DSP2_GAMMA_C240_PRE_LEN) - 1) << DSP2_GAMMA_C240_PRE_POS)
#define DSP2_GAMMA_C240_PRE_UMSK         (~(((1U << DSP2_GAMMA_C240_PRE_LEN) - 1) << DSP2_GAMMA_C240_PRE_POS))
#define DSP2_GAMMA_C241_PRE              DSP2_GAMMA_C241_PRE
#define DSP2_GAMMA_C241_PRE_POS          (8U)
#define DSP2_GAMMA_C241_PRE_LEN          (8U)
#define DSP2_GAMMA_C241_PRE_MSK          (((1U << DSP2_GAMMA_C241_PRE_LEN) - 1) << DSP2_GAMMA_C241_PRE_POS)
#define DSP2_GAMMA_C241_PRE_UMSK         (~(((1U << DSP2_GAMMA_C241_PRE_LEN) - 1) << DSP2_GAMMA_C241_PRE_POS))
#define DSP2_GAMMA_C242_PRE              DSP2_GAMMA_C242_PRE
#define DSP2_GAMMA_C242_PRE_POS          (16U)
#define DSP2_GAMMA_C242_PRE_LEN          (8U)
#define DSP2_GAMMA_C242_PRE_MSK          (((1U << DSP2_GAMMA_C242_PRE_LEN) - 1) << DSP2_GAMMA_C242_PRE_POS)
#define DSP2_GAMMA_C242_PRE_UMSK         (~(((1U << DSP2_GAMMA_C242_PRE_LEN) - 1) << DSP2_GAMMA_C242_PRE_POS))
#define DSP2_GAMMA_C243_PRE              DSP2_GAMMA_C243_PRE
#define DSP2_GAMMA_C243_PRE_POS          (24U)
#define DSP2_GAMMA_C243_PRE_LEN          (8U)
#define DSP2_GAMMA_C243_PRE_MSK          (((1U << DSP2_GAMMA_C243_PRE_LEN) - 1) << DSP2_GAMMA_C243_PRE_POS)
#define DSP2_GAMMA_C243_PRE_UMSK         (~(((1U << DSP2_GAMMA_C243_PRE_LEN) - 1) << DSP2_GAMMA_C243_PRE_POS))

/* 0x7F4 : GAMMA_CRUVE_62 */
#define DSP2_GAMMA_GAMMA_CRUVE_62_OFFSET (0x7F4)
#define DSP2_GAMMA_C244_PRE              DSP2_GAMMA_C244_PRE
#define DSP2_GAMMA_C244_PRE_POS          (0U)
#define DSP2_GAMMA_C244_PRE_LEN          (8U)
#define DSP2_GAMMA_C244_PRE_MSK          (((1U << DSP2_GAMMA_C244_PRE_LEN) - 1) << DSP2_GAMMA_C244_PRE_POS)
#define DSP2_GAMMA_C244_PRE_UMSK         (~(((1U << DSP2_GAMMA_C244_PRE_LEN) - 1) << DSP2_GAMMA_C244_PRE_POS))
#define DSP2_GAMMA_C245_PRE              DSP2_GAMMA_C245_PRE
#define DSP2_GAMMA_C245_PRE_POS          (8U)
#define DSP2_GAMMA_C245_PRE_LEN          (8U)
#define DSP2_GAMMA_C245_PRE_MSK          (((1U << DSP2_GAMMA_C245_PRE_LEN) - 1) << DSP2_GAMMA_C245_PRE_POS)
#define DSP2_GAMMA_C245_PRE_UMSK         (~(((1U << DSP2_GAMMA_C245_PRE_LEN) - 1) << DSP2_GAMMA_C245_PRE_POS))
#define DSP2_GAMMA_C246_PRE              DSP2_GAMMA_C246_PRE
#define DSP2_GAMMA_C246_PRE_POS          (16U)
#define DSP2_GAMMA_C246_PRE_LEN          (8U)
#define DSP2_GAMMA_C246_PRE_MSK          (((1U << DSP2_GAMMA_C246_PRE_LEN) - 1) << DSP2_GAMMA_C246_PRE_POS)
#define DSP2_GAMMA_C246_PRE_UMSK         (~(((1U << DSP2_GAMMA_C246_PRE_LEN) - 1) << DSP2_GAMMA_C246_PRE_POS))
#define DSP2_GAMMA_C247_PRE              DSP2_GAMMA_C247_PRE
#define DSP2_GAMMA_C247_PRE_POS          (24U)
#define DSP2_GAMMA_C247_PRE_LEN          (8U)
#define DSP2_GAMMA_C247_PRE_MSK          (((1U << DSP2_GAMMA_C247_PRE_LEN) - 1) << DSP2_GAMMA_C247_PRE_POS)
#define DSP2_GAMMA_C247_PRE_UMSK         (~(((1U << DSP2_GAMMA_C247_PRE_LEN) - 1) << DSP2_GAMMA_C247_PRE_POS))

/* 0x7F8 : GAMMA_CRUVE_63 */
#define DSP2_GAMMA_GAMMA_CRUVE_63_OFFSET (0x7F8)
#define DSP2_GAMMA_C248_PRE              DSP2_GAMMA_C248_PRE
#define DSP2_GAMMA_C248_PRE_POS          (0U)
#define DSP2_GAMMA_C248_PRE_LEN          (8U)
#define DSP2_GAMMA_C248_PRE_MSK          (((1U << DSP2_GAMMA_C248_PRE_LEN) - 1) << DSP2_GAMMA_C248_PRE_POS)
#define DSP2_GAMMA_C248_PRE_UMSK         (~(((1U << DSP2_GAMMA_C248_PRE_LEN) - 1) << DSP2_GAMMA_C248_PRE_POS))
#define DSP2_GAMMA_C249_PRE              DSP2_GAMMA_C249_PRE
#define DSP2_GAMMA_C249_PRE_POS          (8U)
#define DSP2_GAMMA_C249_PRE_LEN          (8U)
#define DSP2_GAMMA_C249_PRE_MSK          (((1U << DSP2_GAMMA_C249_PRE_LEN) - 1) << DSP2_GAMMA_C249_PRE_POS)
#define DSP2_GAMMA_C249_PRE_UMSK         (~(((1U << DSP2_GAMMA_C249_PRE_LEN) - 1) << DSP2_GAMMA_C249_PRE_POS))
#define DSP2_GAMMA_C250_PRE              DSP2_GAMMA_C250_PRE
#define DSP2_GAMMA_C250_PRE_POS          (16U)
#define DSP2_GAMMA_C250_PRE_LEN          (8U)
#define DSP2_GAMMA_C250_PRE_MSK          (((1U << DSP2_GAMMA_C250_PRE_LEN) - 1) << DSP2_GAMMA_C250_PRE_POS)
#define DSP2_GAMMA_C250_PRE_UMSK         (~(((1U << DSP2_GAMMA_C250_PRE_LEN) - 1) << DSP2_GAMMA_C250_PRE_POS))
#define DSP2_GAMMA_C251_PRE              DSP2_GAMMA_C251_PRE
#define DSP2_GAMMA_C251_PRE_POS          (24U)
#define DSP2_GAMMA_C251_PRE_LEN          (8U)
#define DSP2_GAMMA_C251_PRE_MSK          (((1U << DSP2_GAMMA_C251_PRE_LEN) - 1) << DSP2_GAMMA_C251_PRE_POS)
#define DSP2_GAMMA_C251_PRE_UMSK         (~(((1U << DSP2_GAMMA_C251_PRE_LEN) - 1) << DSP2_GAMMA_C251_PRE_POS))

/* 0x7FC : GAMMA_CRUVE_64 */
#define DSP2_GAMMA_GAMMA_CRUVE_64_OFFSET (0x7FC)
#define DSP2_GAMMA_C252_PRE              DSP2_GAMMA_C252_PRE
#define DSP2_GAMMA_C252_PRE_POS          (0U)
#define DSP2_GAMMA_C252_PRE_LEN          (8U)
#define DSP2_GAMMA_C252_PRE_MSK          (((1U << DSP2_GAMMA_C252_PRE_LEN) - 1) << DSP2_GAMMA_C252_PRE_POS)
#define DSP2_GAMMA_C252_PRE_UMSK         (~(((1U << DSP2_GAMMA_C252_PRE_LEN) - 1) << DSP2_GAMMA_C252_PRE_POS))
#define DSP2_GAMMA_C253_PRE              DSP2_GAMMA_C253_PRE
#define DSP2_GAMMA_C253_PRE_POS          (8U)
#define DSP2_GAMMA_C253_PRE_LEN          (8U)
#define DSP2_GAMMA_C253_PRE_MSK          (((1U << DSP2_GAMMA_C253_PRE_LEN) - 1) << DSP2_GAMMA_C253_PRE_POS)
#define DSP2_GAMMA_C253_PRE_UMSK         (~(((1U << DSP2_GAMMA_C253_PRE_LEN) - 1) << DSP2_GAMMA_C253_PRE_POS))
#define DSP2_GAMMA_C254_PRE              DSP2_GAMMA_C254_PRE
#define DSP2_GAMMA_C254_PRE_POS          (16U)
#define DSP2_GAMMA_C254_PRE_LEN          (8U)
#define DSP2_GAMMA_C254_PRE_MSK          (((1U << DSP2_GAMMA_C254_PRE_LEN) - 1) << DSP2_GAMMA_C254_PRE_POS)
#define DSP2_GAMMA_C254_PRE_UMSK         (~(((1U << DSP2_GAMMA_C254_PRE_LEN) - 1) << DSP2_GAMMA_C254_PRE_POS))
#define DSP2_GAMMA_C255_PRE              DSP2_GAMMA_C255_PRE
#define DSP2_GAMMA_C255_PRE_POS          (24U)
#define DSP2_GAMMA_C255_PRE_LEN          (8U)
#define DSP2_GAMMA_C255_PRE_MSK          (((1U << DSP2_GAMMA_C255_PRE_LEN) - 1) << DSP2_GAMMA_C255_PRE_POS)
#define DSP2_GAMMA_C255_PRE_UMSK         (~(((1U << DSP2_GAMMA_C255_PRE_LEN) - 1) << DSP2_GAMMA_C255_PRE_POS))

struct dsp2_gamma_reg {
    /* 0x0  reserved */
    uint8_t RESERVED0x0[1792];

    /* 0x700 : GAMMA_CRUVE_1 */
    union {
        struct
        {
            uint32_t c0_pre : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t c1_pre : 8; /* [15: 8],        r/w,        0x5 */
            uint32_t c2_pre : 8; /* [23:16],        r/w,        0x7 */
            uint32_t c3_pre : 8; /* [31:24],        r/w,        0xa */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_1;

