RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_gamma_reg.h
    /* 0x704 : GAMMA_CRUVE_2 */
    union {
        struct
        {
            uint32_t c4_pre : 8; /* [ 7: 0],        r/w,        0xd */
            uint32_t c5_pre : 8; /* [15: 8],        r/w,       0x11 */
            uint32_t c6_pre : 8; /* [23:16],        r/w,       0x14 */
            uint32_t c7_pre : 8; /* [31:24],        r/w,       0x17 */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_2;

    /* 0x708 : GAMMA_CRUVE_3 */
    union {
        struct
        {
            uint32_t c8_pre  : 8; /* [ 7: 0],        r/w,       0x1a */
            uint32_t c9_pre  : 8; /* [15: 8],        r/w,       0x1e */
            uint32_t c10_pre : 8; /* [23:16],        r/w,       0x21 */
            uint32_t c11_pre : 8; /* [31:24],        r/w,       0x24 */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_3;

    /* 0x70C : GAMMA_CRUVE_4 */
    union {
        struct
        {
            uint32_t c12_pre : 8; /* [ 7: 0],        r/w,       0x27 */
            uint32_t c13_pre : 8; /* [15: 8],        r/w,       0x2a */
            uint32_t c14_pre : 8; /* [23:16],        r/w,       0x2d */
            uint32_t c15_pre : 8; /* [31:24],        r/w,       0x30 */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_4;

    /* 0x710 : GAMMA_CRUVE_5 */
    union {
        struct
        {
            uint32_t c16_pre : 8; /* [ 7: 0],        r/w,       0x34 */
            uint32_t c17_pre : 8; /* [15: 8],        r/w,       0x36 */
            uint32_t c18_pre : 8; /* [23:16],        r/w,       0x39 */
            uint32_t c19_pre : 8; /* [31:24],        r/w,       0x3c */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_5;

    /* 0x714 : GAMMA_CRUVE_6 */
    union {
        struct
        {
            uint32_t c20_pre : 8; /* [ 7: 0],        r/w,       0x3f */
            uint32_t c21_pre : 8; /* [15: 8],        r/w,       0x42 */
            uint32_t c22_pre : 8; /* [23:16],        r/w,       0x45 */
            uint32_t c23_pre : 8; /* [31:24],        r/w,       0x47 */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_6;

    /* 0x718 : GAMMA_CRUVE_7 */
    union {
        struct
        {
            uint32_t c24_pre : 8; /* [ 7: 0],        r/w,       0x4a */
            uint32_t c25_pre : 8; /* [15: 8],        r/w,       0x4d */
            uint32_t c26_pre : 8; /* [23:16],        r/w,       0x4f */
            uint32_t c27_pre : 8; /* [31:24],        r/w,       0x52 */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_7;

    /* 0x71C : GAMMA_CRUVE_8 */
    union {
        struct
        {
            uint32_t c28_pre : 8; /* [ 7: 0],        r/w,       0x54 */
            uint32_t c29_pre : 8; /* [15: 8],        r/w,       0x57 */
            uint32_t c30_pre : 8; /* [23:16],        r/w,       0x59 */
            uint32_t c31_pre : 8; /* [31:24],        r/w,       0x5b */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_8;

    /* 0x720 : GAMMA_CRUVE_9 */
    union {
        struct
        {
            uint32_t c32_pre : 8; /* [ 7: 0],        r/w,       0x5e */
            uint32_t c33_pre : 8; /* [15: 8],        r/w,       0x60 */
            uint32_t c34_pre : 8; /* [23:16],        r/w,       0x62 */
            uint32_t c35_pre : 8; /* [31:24],        r/w,       0x64 */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_9;

    /* 0x724 : GAMMA_CRUVE_10 */
    union {
        struct
        {
            uint32_t c36_pre : 8; /* [ 7: 0],        r/w,       0x66 */
            uint32_t c37_pre : 8; /* [15: 8],        r/w,       0x68 */
            uint32_t c38_pre : 8; /* [23:16],        r/w,       0x6a */
            uint32_t c39_pre : 8; /* [31:24],        r/w,       0x6c */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_10;

    /* 0x728 : GAMMA_CRUVE_11 */
    union {
        struct
        {
            uint32_t c40_pre : 8; /* [ 7: 0],        r/w,       0x6e */
            uint32_t c41_pre : 8; /* [15: 8],        r/w,       0x70 */
            uint32_t c42_pre : 8; /* [23:16],        r/w,       0x72 */
            uint32_t c43_pre : 8; /* [31:24],        r/w,       0x74 */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_11;

    /* 0x72C : GAMMA_CRUVE_12 */
    union {
        struct
        {
            uint32_t c44_pre : 8; /* [ 7: 0],        r/w,       0x76 */
            uint32_t c45_pre : 8; /* [15: 8],        r/w,       0x78 */
            uint32_t c46_pre : 8; /* [23:16],        r/w,       0x7a */
            uint32_t c47_pre : 8; /* [31:24],        r/w,       0x7b */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_12;

    /* 0x730 : GAMMA_CRUVE_13 */
    union {
        struct
        {
            uint32_t c48_pre : 8; /* [ 7: 0],        r/w,       0x7d */
            uint32_t c49_pre : 8; /* [15: 8],        r/w,       0x7f */
            uint32_t c50_pre : 8; /* [23:16],        r/w,       0x80 */
            uint32_t c51_pre : 8; /* [31:24],        r/w,       0x82 */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_13;

    /* 0x734 : GAMMA_CRUVE_14 */
    union {
        struct
        {
            uint32_t c52_pre : 8; /* [ 7: 0],        r/w,       0x84 */
            uint32_t c53_pre : 8; /* [15: 8],        r/w,       0x85 */
            uint32_t c54_pre : 8; /* [23:16],        r/w,       0x87 */
            uint32_t c55_pre : 8; /* [31:24],        r/w,       0x88 */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_14;

    /* 0x738 : GAMMA_CRUVE_15 */
    union {
        struct
        {
            uint32_t c56_pre : 8; /* [ 7: 0],        r/w,       0x8a */
            uint32_t c57_pre : 8; /* [15: 8],        r/w,       0x8b */
            uint32_t c58_pre : 8; /* [23:16],        r/w,       0x8d */
            uint32_t c59_pre : 8; /* [31:24],        r/w,       0x8e */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_15;

    /* 0x73C : GAMMA_CRUVE_16 */
    union {
        struct
        {
            uint32_t c60_pre : 8; /* [ 7: 0],        r/w,       0x90 */
            uint32_t c61_pre : 8; /* [15: 8],        r/w,       0x91 */
            uint32_t c62_pre : 8; /* [23:16],        r/w,       0x92 */
            uint32_t c63_pre : 8; /* [31:24],        r/w,       0x94 */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_16;

    /* 0x740 : GAMMA_CRUVE_17 */
    union {
        struct
        {
            uint32_t c64_pre : 8; /* [ 7: 0],        r/w,       0x95 */
            uint32_t c65_pre : 8; /* [15: 8],        r/w,       0x96 */
            uint32_t c66_pre : 8; /* [23:16],        r/w,       0x98 */
            uint32_t c67_pre : 8; /* [31:24],        r/w,       0x99 */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_17;

    /* 0x744 : GAMMA_CRUVE_18 */
    union {
        struct
        {
            uint32_t c68_pre : 8; /* [ 7: 0],        r/w,       0x9a */
            uint32_t c69_pre : 8; /* [15: 8],        r/w,       0x9c */
            uint32_t c70_pre : 8; /* [23:16],        r/w,       0x9d */
            uint32_t c71_pre : 8; /* [31:24],        r/w,       0x9e */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_18;

    /* 0x748 : GAMMA_CRUVE_19 */
    union {
        struct
        {
            uint32_t c72_pre : 8; /* [ 7: 0],        r/w,       0xa0 */
            uint32_t c73_pre : 8; /* [15: 8],        r/w,       0xa1 */
            uint32_t c74_pre : 8; /* [23:16],        r/w,       0xa2 */
            uint32_t c75_pre : 8; /* [31:24],        r/w,       0xa3 */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_19;

    /* 0x74C : GAMMA_CRUVE_20 */
    union {
        struct
        {
            uint32_t c76_pre : 8; /* [ 7: 0],        r/w,       0xa5 */
            uint32_t c77_pre : 8; /* [15: 8],        r/w,       0xa6 */
            uint32_t c78_pre : 8; /* [23:16],        r/w,       0xa7 */
            uint32_t c79_pre : 8; /* [31:24],        r/w,       0xa8 */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_20;

    /* 0x750 : GAMMA_CRUVE_21 */
    union {
        struct
        {
            uint32_t c80_pre : 8; /* [ 7: 0],        r/w,       0xa9 */
            uint32_t c81_pre : 8; /* [15: 8],        r/w,       0xab */
            uint32_t c82_pre : 8; /* [23:16],        r/w,       0xac */
            uint32_t c83_pre : 8; /* [31:24],        r/w,       0xad */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_21;

    /* 0x754 : GAMMA_CRUVE_22 */
    union {
        struct
        {
            uint32_t c84_pre : 8; /* [ 7: 0],        r/w,       0xae */
            uint32_t c85_pre : 8; /* [15: 8],        r/w,       0xaf */
            uint32_t c86_pre : 8; /* [23:16],        r/w,       0xb0 */
            uint32_t c87_pre : 8; /* [31:24],        r/w,       0xb1 */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_22;

    /* 0x758 : GAMMA_CRUVE_23 */
    union {
        struct
        {
            uint32_t c88_pre : 8; /* [ 7: 0],        r/w,       0xb3 */
            uint32_t c89_pre : 8; /* [15: 8],        r/w,       0xb4 */
            uint32_t c90_pre : 8; /* [23:16],        r/w,       0xb5 */
            uint32_t c91_pre : 8; /* [31:24],        r/w,       0xb6 */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_23;

    /* 0x75C : GAMMA_CRUVE_24 */
    union {
        struct
        {
            uint32_t c92_pre : 8; /* [ 7: 0],        r/w,       0xb7 */
            uint32_t c93_pre : 8; /* [15: 8],        r/w,       0xb8 */
            uint32_t c94_pre : 8; /* [23:16],        r/w,       0xb9 */
            uint32_t c95_pre : 8; /* [31:24],        r/w,       0xba */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_24;

    /* 0x760 : GAMMA_CRUVE_25 */
    union {
        struct
        {
            uint32_t c96_pre : 8; /* [ 7: 0],        r/w,       0xbb */
            uint32_t c97_pre : 8; /* [15: 8],        r/w,       0xbc */
            uint32_t c98_pre : 8; /* [23:16],        r/w,       0xbd */
            uint32_t c99_pre : 8; /* [31:24],        r/w,       0xbe */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_25;

