RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_gamma_reg.h
    /* 0x764 : GAMMA_CRUVE_26 */
    union {
        struct
        {
            uint32_t c100_pre : 8; /* [ 7: 0],        r/w,       0xbf */
            uint32_t c101_pre : 8; /* [15: 8],        r/w,       0xc0 */
            uint32_t c102_pre : 8; /* [23:16],        r/w,       0xc1 */
            uint32_t c103_pre : 8; /* [31:24],        r/w,       0xc2 */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_26;

    /* 0x768 : GAMMA_CRUVE_27 */
    union {
        struct
        {
            uint32_t c104_pre : 8; /* [ 7: 0],        r/w,       0xc3 */
            uint32_t c105_pre : 8; /* [15: 8],        r/w,       0xc4 */
            uint32_t c106_pre : 8; /* [23:16],        r/w,       0xc5 */
            uint32_t c107_pre : 8; /* [31:24],        r/w,       0xc6 */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_27;

    /* 0x76C : GAMMA_CRUVE_28 */
    union {
        struct
        {
            uint32_t c108_pre : 8; /* [ 7: 0],        r/w,       0xc7 */
            uint32_t c109_pre : 8; /* [15: 8],        r/w,       0xc8 */
            uint32_t c110_pre : 8; /* [23:16],        r/w,       0xc8 */
            uint32_t c111_pre : 8; /* [31:24],        r/w,       0xc9 */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_28;

    /* 0x770 : GAMMA_CRUVE_29 */
    union {
        struct
        {
            uint32_t c112_pre : 8; /* [ 7: 0],        r/w,       0xca */
            uint32_t c113_pre : 8; /* [15: 8],        r/w,       0xcb */
            uint32_t c114_pre : 8; /* [23:16],        r/w,       0xcc */
            uint32_t c115_pre : 8; /* [31:24],        r/w,       0xcd */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_29;

    /* 0x774 : GAMMA_CRUVE_30 */
    union {
        struct
        {
            uint32_t c116_pre : 8; /* [ 7: 0],        r/w,       0xcd */
            uint32_t c117_pre : 8; /* [15: 8],        r/w,       0xce */
            uint32_t c118_pre : 8; /* [23:16],        r/w,       0xcf */
            uint32_t c119_pre : 8; /* [31:24],        r/w,       0xd0 */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_30;

    /* 0x778 : GAMMA_CRUVE_31 */
    union {
        struct
        {
            uint32_t c120_pre : 8; /* [ 7: 0],        r/w,       0xd1 */
            uint32_t c121_pre : 8; /* [15: 8],        r/w,       0xd1 */
            uint32_t c122_pre : 8; /* [23:16],        r/w,       0xd2 */
            uint32_t c123_pre : 8; /* [31:24],        r/w,       0xd3 */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_31;

    /* 0x77C : GAMMA_CRUVE_32 */
    union {
        struct
        {
            uint32_t c124_pre : 8; /* [ 7: 0],        r/w,       0xd4 */
            uint32_t c125_pre : 8; /* [15: 8],        r/w,       0xd4 */
            uint32_t c126_pre : 8; /* [23:16],        r/w,       0xd5 */
            uint32_t c127_pre : 8; /* [31:24],        r/w,       0xd6 */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_32;

    /* 0x780 : GAMMA_CRUVE_33 */
    union {
        struct
        {
            uint32_t c128_pre : 8; /* [ 7: 0],        r/w,       0xd6 */
            uint32_t c129_pre : 8; /* [15: 8],        r/w,       0xd7 */
            uint32_t c130_pre : 8; /* [23:16],        r/w,       0xd8 */
            uint32_t c131_pre : 8; /* [31:24],        r/w,       0xd8 */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_33;

    /* 0x784 : GAMMA_CRUVE_34 */
    union {
        struct
        {
            uint32_t c132_pre : 8; /* [ 7: 0],        r/w,       0xd9 */
            uint32_t c133_pre : 8; /* [15: 8],        r/w,       0xda */
            uint32_t c134_pre : 8; /* [23:16],        r/w,       0xda */
            uint32_t c135_pre : 8; /* [31:24],        r/w,       0xdb */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_34;

    /* 0x788 : GAMMA_CRUVE_35 */
    union {
        struct
        {
            uint32_t c136_pre : 8; /* [ 7: 0],        r/w,       0xdb */
            uint32_t c137_pre : 8; /* [15: 8],        r/w,       0xdc */
            uint32_t c138_pre : 8; /* [23:16],        r/w,       0xdd */
            uint32_t c139_pre : 8; /* [31:24],        r/w,       0xdd */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_35;

    /* 0x78C : GAMMA_CRUVE_36 */
    union {
        struct
        {
            uint32_t c140_pre : 8; /* [ 7: 0],        r/w,       0xde */
            uint32_t c141_pre : 8; /* [15: 8],        r/w,       0xde */
            uint32_t c142_pre : 8; /* [23:16],        r/w,       0xdf */
            uint32_t c143_pre : 8; /* [31:24],        r/w,       0xdf */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_36;

    /* 0x790 : GAMMA_CRUVE_37 */
    union {
        struct
        {
            uint32_t c144_pre : 8; /* [ 7: 0],        r/w,       0xe0 */
            uint32_t c145_pre : 8; /* [15: 8],        r/w,       0xe1 */
            uint32_t c146_pre : 8; /* [23:16],        r/w,       0xe1 */
            uint32_t c147_pre : 8; /* [31:24],        r/w,       0xe2 */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_37;

    /* 0x794 : GAMMA_CRUVE_38 */
    union {
        struct
        {
            uint32_t c148_pre : 8; /* [ 7: 0],        r/w,       0xe2 */
            uint32_t c149_pre : 8; /* [15: 8],        r/w,       0xe3 */
            uint32_t c150_pre : 8; /* [23:16],        r/w,       0xe3 */
            uint32_t c151_pre : 8; /* [31:24],        r/w,       0xe4 */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_38;

    /* 0x798 : GAMMA_CRUVE_39 */
    union {
        struct
        {
            uint32_t c152_pre : 8; /* [ 7: 0],        r/w,       0xe4 */
            uint32_t c153_pre : 8; /* [15: 8],        r/w,       0xe5 */
            uint32_t c154_pre : 8; /* [23:16],        r/w,       0xe5 */
            uint32_t c155_pre : 8; /* [31:24],        r/w,       0xe5 */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_39;

    /* 0x79C : GAMMA_CRUVE_40 */
    union {
        struct
        {
            uint32_t c156_pre : 8; /* [ 7: 0],        r/w,       0xe6 */
            uint32_t c157_pre : 8; /* [15: 8],        r/w,       0xe6 */
            uint32_t c158_pre : 8; /* [23:16],        r/w,       0xe7 */
            uint32_t c159_pre : 8; /* [31:24],        r/w,       0xe7 */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_40;

    /* 0x7A0 : GAMMA_CRUVE_41 */
    union {
        struct
        {
            uint32_t c160_pre : 8; /* [ 7: 0],        r/w,       0xe8 */
            uint32_t c161_pre : 8; /* [15: 8],        r/w,       0xe8 */
            uint32_t c162_pre : 8; /* [23:16],        r/w,       0xe9 */
            uint32_t c163_pre : 8; /* [31:24],        r/w,       0xe9 */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_41;

    /* 0x7A4 : GAMMA_CRUVE_42 */
    union {
        struct
        {
            uint32_t c164_pre : 8; /* [ 7: 0],        r/w,       0xe9 */
            uint32_t c165_pre : 8; /* [15: 8],        r/w,       0xea */
            uint32_t c166_pre : 8; /* [23:16],        r/w,       0xea */
            uint32_t c167_pre : 8; /* [31:24],        r/w,       0xeb */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_42;

    /* 0x7A8 : GAMMA_CRUVE_43 */
    union {
        struct
        {
            uint32_t c168_pre : 8; /* [ 7: 0],        r/w,       0xeb */
            uint32_t c169_pre : 8; /* [15: 8],        r/w,       0xeb */
            uint32_t c170_pre : 8; /* [23:16],        r/w,       0xec */
            uint32_t c171_pre : 8; /* [31:24],        r/w,       0xec */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_43;

    /* 0x7AC : GAMMA_CRUVE_44 */
    union {
        struct
        {
            uint32_t c172_pre : 8; /* [ 7: 0],        r/w,       0xec */
            uint32_t c173_pre : 8; /* [15: 8],        r/w,       0xed */
            uint32_t c174_pre : 8; /* [23:16],        r/w,       0xed */
            uint32_t c175_pre : 8; /* [31:24],        r/w,       0xed */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_44;

