RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_gamma_reg.h
    /* 0x7B0 : GAMMA_CRUVE_45 */
    union {
        struct
        {
            uint32_t c176_pre : 8; /* [ 7: 0],        r/w,       0xee */
            uint32_t c177_pre : 8; /* [15: 8],        r/w,       0xee */
            uint32_t c178_pre : 8; /* [23:16],        r/w,       0xee */
            uint32_t c179_pre : 8; /* [31:24],        r/w,       0xef */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_45;

    /* 0x7B4 : GAMMA_CRUVE_46 */
    union {
        struct
        {
            uint32_t c180_pre : 8; /* [ 7: 0],        r/w,       0xef */
            uint32_t c181_pre : 8; /* [15: 8],        r/w,       0xef */
            uint32_t c182_pre : 8; /* [23:16],        r/w,       0xf0 */
            uint32_t c183_pre : 8; /* [31:24],        r/w,       0xf0 */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_46;

    /* 0x7B8 : GAMMA_CRUVE_47 */
    union {
        struct
        {
            uint32_t c184_pre : 8; /* [ 7: 0],        r/w,       0xf0 */
            uint32_t c185_pre : 8; /* [15: 8],        r/w,       0xf1 */
            uint32_t c186_pre : 8; /* [23:16],        r/w,       0xf1 */
            uint32_t c187_pre : 8; /* [31:24],        r/w,       0xf1 */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_47;

    /* 0x7BC : GAMMA_CRUVE_48 */
    union {
        struct
        {
            uint32_t c188_pre : 8; /* [ 7: 0],        r/w,       0xf2 */
            uint32_t c189_pre : 8; /* [15: 8],        r/w,       0xf2 */
            uint32_t c190_pre : 8; /* [23:16],        r/w,       0xf2 */
            uint32_t c191_pre : 8; /* [31:24],        r/w,       0xf2 */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_48;

    /* 0x7C0 : GAMMA_CRUVE_49 */
    union {
        struct
        {
            uint32_t c192_pre : 8; /* [ 7: 0],        r/w,       0xf3 */
            uint32_t c193_pre : 8; /* [15: 8],        r/w,       0xf3 */
            uint32_t c194_pre : 8; /* [23:16],        r/w,       0xf3 */
            uint32_t c195_pre : 8; /* [31:24],        r/w,       0xf3 */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_49;

    /* 0x7C4 : GAMMA_CRUVE_50 */
    union {
        struct
        {
            uint32_t c196_pre : 8; /* [ 7: 0],        r/w,       0xf4 */
            uint32_t c197_pre : 8; /* [15: 8],        r/w,       0xf4 */
            uint32_t c198_pre : 8; /* [23:16],        r/w,       0xf4 */
            uint32_t c199_pre : 8; /* [31:24],        r/w,       0xf4 */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_50;

    /* 0x7C8 : GAMMA_CRUVE_51 */
    union {
        struct
        {
            uint32_t c200_pre : 8; /* [ 7: 0],        r/w,       0xf5 */
            uint32_t c201_pre : 8; /* [15: 8],        r/w,       0xf5 */
            uint32_t c202_pre : 8; /* [23:16],        r/w,       0xf5 */
            uint32_t c203_pre : 8; /* [31:24],        r/w,       0xf5 */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_51;

    /* 0x7CC : GAMMA_CRUVE_52 */
    union {
        struct
        {
            uint32_t c204_pre : 8; /* [ 7: 0],        r/w,       0xf6 */
            uint32_t c205_pre : 8; /* [15: 8],        r/w,       0xf6 */
            uint32_t c206_pre : 8; /* [23:16],        r/w,       0xf6 */
            uint32_t c207_pre : 8; /* [31:24],        r/w,       0xf6 */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_52;

    /* 0x7D0 : GAMMA_CRUVE_53 */
    union {
        struct
        {
            uint32_t c208_pre : 8; /* [ 7: 0],        r/w,       0xf7 */
            uint32_t c209_pre : 8; /* [15: 8],        r/w,       0xf7 */
            uint32_t c210_pre : 8; /* [23:16],        r/w,       0xf7 */
            uint32_t c211_pre : 8; /* [31:24],        r/w,       0xf7 */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_53;

    /* 0x7D4 : GAMMA_CRUVE_54 */
    union {
        struct
        {
            uint32_t c212_pre : 8; /* [ 7: 0],        r/w,       0xf7 */
            uint32_t c213_pre : 8; /* [15: 8],        r/w,       0xf8 */
            uint32_t c214_pre : 8; /* [23:16],        r/w,       0xf8 */
            uint32_t c215_pre : 8; /* [31:24],        r/w,       0xf8 */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_54;

    /* 0x7D8 : GAMMA_CRUVE_55 */
    union {
        struct
        {
            uint32_t c216_pre : 8; /* [ 7: 0],        r/w,       0xf8 */
            uint32_t c217_pre : 8; /* [15: 8],        r/w,       0xf8 */
            uint32_t c218_pre : 8; /* [23:16],        r/w,       0xf9 */
            uint32_t c219_pre : 8; /* [31:24],        r/w,       0xf9 */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_55;

    /* 0x7DC : GAMMA_CRUVE_56 */
    union {
        struct
        {
            uint32_t c220_pre : 8; /* [ 7: 0],        r/w,       0xf9 */
            uint32_t c221_pre : 8; /* [15: 8],        r/w,       0xf9 */
            uint32_t c222_pre : 8; /* [23:16],        r/w,       0xf9 */
            uint32_t c223_pre : 8; /* [31:24],        r/w,       0xfa */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_56;

    /* 0x7E0 : GAMMA_CRUVE_57 */
    union {
        struct
        {
            uint32_t c224_pre : 8; /* [ 7: 0],        r/w,       0xfa */
            uint32_t c225_pre : 8; /* [15: 8],        r/w,       0xfa */
            uint32_t c226_pre : 8; /* [23:16],        r/w,       0xfa */
            uint32_t c227_pre : 8; /* [31:24],        r/w,       0xfa */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_57;

    /* 0x7E4 : GAMMA_CRUVE_58 */
    union {
        struct
        {
            uint32_t c228_pre : 8; /* [ 7: 0],        r/w,       0xfb */
            uint32_t c229_pre : 8; /* [15: 8],        r/w,       0xfb */
            uint32_t c230_pre : 8; /* [23:16],        r/w,       0xfb */
            uint32_t c231_pre : 8; /* [31:24],        r/w,       0xfb */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_58;

    /* 0x7E8 : GAMMA_CRUVE_59 */
    union {
        struct
        {
            uint32_t c232_pre : 8; /* [ 7: 0],        r/w,       0xfb */
            uint32_t c233_pre : 8; /* [15: 8],        r/w,       0xfb */
            uint32_t c234_pre : 8; /* [23:16],        r/w,       0xfc */
            uint32_t c235_pre : 8; /* [31:24],        r/w,       0xfc */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_59;

