RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_gamma_reg.h
    /* 0x7EC : GAMMA_CRUVE_60 */
    union {
        struct
        {
            uint32_t c236_pre : 8; /* [ 7: 0],        r/w,       0xfc */
            uint32_t c237_pre : 8; /* [15: 8],        r/w,       0xfc */
            uint32_t c238_pre : 8; /* [23:16],        r/w,       0xfc */
            uint32_t c239_pre : 8; /* [31:24],        r/w,       0xfc */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_60;

    /* 0x7F0 : GAMMA_CRUVE_61 */
    union {
        struct
        {
            uint32_t c240_pre : 8; /* [ 7: 0],        r/w,       0xfd */
            uint32_t c241_pre : 8; /* [15: 8],        r/w,       0xfd */
            uint32_t c242_pre : 8; /* [23:16],        r/w,       0xfd */
            uint32_t c243_pre : 8; /* [31:24],        r/w,       0xfd */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_61;

    /* 0x7F4 : GAMMA_CRUVE_62 */
    union {
        struct
        {
            uint32_t c244_pre : 8; /* [ 7: 0],        r/w,       0xfd */
            uint32_t c245_pre : 8; /* [15: 8],        r/w,       0xfd */
            uint32_t c246_pre : 8; /* [23:16],        r/w,       0xfe */
            uint32_t c247_pre : 8; /* [31:24],        r/w,       0xfe */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_62;

    /* 0x7F8 : GAMMA_CRUVE_63 */
    union {
        struct
        {
            uint32_t c248_pre : 8; /* [ 7: 0],        r/w,       0xfe */
            uint32_t c249_pre : 8; /* [15: 8],        r/w,       0xfe */
            uint32_t c250_pre : 8; /* [23:16],        r/w,       0xfe */
            uint32_t c251_pre : 8; /* [31:24],        r/w,       0xfe */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_63;

    /* 0x7FC : GAMMA_CRUVE_64 */
    union {
        struct
        {
            uint32_t c252_pre : 8; /* [ 7: 0],        r/w,       0xff */
            uint32_t c253_pre : 8; /* [15: 8],        r/w,       0xff */
            uint32_t c254_pre : 8; /* [23:16],        r/w,       0xff */
            uint32_t c255_pre : 8; /* [31:24],        r/w,       0xff */
        } BF;
        uint32_t WORD;
    } GAMMA_CRUVE_64;
};

typedef volatile struct dsp2_gamma_reg dsp2_gamma_reg_t;

#endif /* __DSP2_GAMMA_REG_H__ */
